[
  {
    "id": "DVRO",
    "label": "DVRO",
    "type": "general_information"
  },
  {
    "id": "DVROStart",
    "label": "Domestic Violence Restraining Order",
    "type": "general_information"
  },
  {
    "id": "DV0",
    "label": "What do you need help with?",
    "type": "case_information"
  },
  {
    "id": "DV1",
    "label": "Ask for a new restraining order",
    "type": "general_information"
  },
  {
    "id": "DVCheck2",
    "label": "Are they someone you: dated, married, or had an intimate relationship with, or are related to (parent, child, sibling, grandparent — by birth or marriage?",
    "type": "case_information"
  },
  {
    "id": "DVCheck1",
    "label": "Do you want protection from someone who has abused you or your children? (Abuse can be physical, emotional, financial, or take place online)",
    "type": "case_information"
  },
  {
    "id": "DVCheck3",
    "label": "Are you 12 or older?",
    "type": "case_information"
  },
  {
    "id": "DVStart",
    "label": "You may qualify for a Domestic Violence Restraining Order",
    "type": "general_information"
  },
  {
    "id": "DVAlt",
    "label": "You may qualify for a different restraining order: Civil Harassment, Elder Abuse, Workplace Violence",
    "type": "general_information"
  },
  {
    "id": "DVNotQual",
    "label": "A restraining order is only available if there has been abuse. You may want to speak to a legal aid provider about other options.",
    "type": "general_information"
  },
  {
    "id": "DVForms",
    "label": "To start a Domestic Violence Restraining Order (DVRO), fill out required forms",
    "type": "case_information"
  },
  {
    "id": "DV100a",
    "label": "Step 1: Fill out DV-100 (Request for Domestic Violence Restraining Order)",
    "type": "case_information"
  },
  {
    "id": "DV2",
    "label": "Respond to a restraining order someone else filed",
    "type": "case_information"
  },
  {
    "id": "DV3",
    "label": "Change or end an existing restraining order",
    "type": "general_information"
  },
  {
    "id": "DV5",
    "label": "Renew a restraining order before it expires",
    "type": "general_information"
  },
  {
    "id": "DVFAQ",
    "label": "View Common Questions About DVROs",
    "type": "general_information"
  },
  {
    "id": "DVCQ",
    "label": "Have a question about filling out the DV100? View common questions here:",
    "type": "case_information"
  },
  {
    "id": "DVQ1",
    "label": "What does a DVRO do?",
    "type": "case_information"
  },
  {
    "id": "DVQ2",
    "label": "Is it free to file a DVRO?",
    "type": "case_information"
  },
  {
    "id": "DVQ3",
    "label": "Can I ask for a DVRO if I already have a criminal protective order?",
    "type": "case_information"
  },
  {
    "id": "DVQ4",
    "label": "How fast can I get protection?",
    "type": "case_information"
  },
  {
    "id": "DVQ6",
    "label": "What counts as abuse?",
    "type": "case_information"
  },
  {
    "id": "DVQA2",
    "label": "What if I need more space?",
    "type": "case_information"
  },
  {
    "id": "Proof",
    "label": "How do I include proof?",
    "type": "case_information"
  },
  {
    "id": "DV100d",
    "label": "If you need more space, attach MC-025 (Attachment Form) or use blank paper",
    "type": "general_information"
  },
  {
    "id": "Proof1",
    "label": "If you have proof (texts, emails, photos), attach it to your request",
    "type": "general_information"
  },
  {
    "id": "DV100b",
    "label": "In DV-100, item 5: Describe the MOST recent abuse first — give specific facts",
    "type": "general_information"
  },
  {
    "id": "DV100c",
    "label": "Use item 6 and 7 to describe earlier abuse, including the worst incidents",
    "type": "general_information"
  },
  {
    "id": "CLETSa",
    "label": "Step 2: Fill out CLETS-001 (Confidential CLETS Information). Only the court and law enforcement see this. The other party does NOT get a copy.",
    "type": "case_information"
  },
  {
    "id": "DV109a",
    "label": "Step 3: Fill out DV-109 (Notice of Court Hearing). You only complete items 1 and 2 — the court fills out the rest",
    "type": "case_information"
  },
  {
    "id": "DV110a",
    "label": "Step 4: Fill out DV-110 (Temporary Restraining Order Request). You only complete items 1, 2, and 3 — the court fills out the rest.",
    "type": "case_information"
  },
  {
    "id": "DVReview",
    "label": "Once forms are filled out, go to the Courthouse clerk to file them and ask for a Temporary Restraining Order (TRO), or you may be able to e-file online at the court website",
    "type": "case_information"
  },
  {
    "id": "DVOptional",
    "label": "Do you also want to request other orders such as child custody or visitation, child support or spousal support?",
    "type": "case_information"
  },
  {
    "id": "DVRead",
    "label": "When you get your forms back, read DV-109 (Notice of Court Hearing) and DV-110 (Temporary Restraining Order) carefully",
    "type": "case_information"
  },
  {
    "id": "DVCheckOrders",
    "label": "Was a Temporary Restraining Order (TRO) granted? Check if the judge signed DV-110",
    "type": "case_information"
  },
  {
    "id": "DVTROYes",
    "label": "You now have a Temporary Restraining Order. It lasts until your court date. Keep a copy of DV-110 with you at all times. You can also take photos of it on your phone",
    "type": "general_information"
  },
  {
    "id": "DVTRONo",
    "label": "A TRO was not granted, but you still have a court date where you can provide more information to support granting a restraining order",
    "type": "general_information"
  },
  {
    "id": "DVServePrep",
    "label": "You must now serve the other person with your court papers. Someone 18 or older (not you or someone protected by the order) must personally deliver the documents before your court date - the sherrif or someone else may be able to do this for you",
    "type": "case_information"
  },
  {
    "id": "ServeWho",
    "label": "Would you like the Sherrif to servce your papers for you? You must have the address or location of the other person.",
    "type": "case_information"
  },
  {
    "id": "SERStart",
    "label": "Step 1: Fill out form SER-001 (Request for Sheriff to Serve Court Papers)",
    "type": "case_information"
  },
  {
    "id": "AltStart",
    "label": "Step 1: Choose your server. The server must be 18 or older and not involved in your case. You cannot serve the papers yourself",
    "type": "case_information"
  },
  {
    "id": "SER1",
    "label": "Item 4: Location of the person to be served. List home and/or work address and the times they are likely to be at each location. If you have more than one address, you can list both in item 4a and 4b and include the hours they will be at each place",
    "type": "case_information"
  },
  {
    "id": "SER3",
    "label": "Item 5c: Court hearing date. Use the date listed in DV-109, item 3",
    "type": "general_information"
  },
  {
    "id": "SER4",
    "label": "Item 5d: Deadline to serve. Check DV-109, item 6 for how many days before the court date service must happen. Subtract from the hearing date listed in item 3",
    "type": "case_information"
  },
  {
    "id": "SERGather",
    "label": "Step 2: Gather your court papers to give to the sheriff",
    "type": "general_information"
  },
  {
    "id": "SERPacket",
    "label": "You will need: Completed SER-001, DV-100, DV-109, DV-110 if granted, blank DV-120 and DV-250, and any other forms listed on page 2 of DV-109 such as DV-105, DV-140, DV-108",
    "type": "case_information"
  },
  {
    "id": "SERConfirm",
    "label": "Step 4: Confirm with the sheriff that they received all forms and know your deadline for service",
    "type": "general_information"
  },
  {
    "id": "SheriffReturn",
    "label": "Did you recieve a Proof of Service form from the sheriffs?",
    "type": "case_information"
  },
  {
    "id": "SheriffServed",
    "label": "If the sheriff successfully served the other side, they will give you a completed Proof of Service form. This tells the court that the other person was officially served and allows the case to move forward",
    "type": "case_information"
  },
  {
    "id": "SheriffFailed",
    "label": "If the sheriff was not able to serve, they will give you a form showing when and how they tried. This is sometimes called a Declaration of Due Diligence",
    "type": "case_information"
  },
  {
    "id": "SheriffCopy",
    "label": "Bring a copy of the form to your court date. If you were granted a Temporary Restraining Order (DV-110), and the other side was served, and its a CLETs restraining order, police can enforce the order if it is violated",
    "type": "case_information"
  },
  {
    "id": "AltSafety",
    "label": "If you think it may be dangerous for someone you know to serve papers, ask the sheriff instead",
    "type": "case_information"
  },
  {
    "id": "AltDeadline",
    "label": "Step 2: Check your service deadline. Look at DV-109, item 6 for how many days before the court date service must happen. Count backwards from the hearing date in item 3",
    "type": "general_information"
  },
  {
    "id": "AltPapers",
    "label": "Step 3: Give your server all court papers to deliver. This includes DV-100, DV-109, DV-110 if granted, blank DV-120, blank DV-250, and any other forms listed on page 2 of DV-109 such as DV-105 or DV-140",
    "type": "case_information"
  },
  {
    "id": "AltDV200",
    "label": "Step 4: Partially complete form DV-200 (Proof of Personal Service). Fill out items 1 through 3. Your server will fill out the rest after serving",
    "type": "case_information"
  },
  {
    "id": "AltServe",
    "label": "Step 5: Ask your server to deliver the papers as soon as possible and before the deadline. They must complete DV-200 and return it to you",
    "type": "case_information"
  },
  {
    "id": "AltRefuse",
    "label": "If the other side refuses to take the papers, your server can still leave them nearby and note that on DV-200",
    "type": "general_information"
  },
  {
    "id": "AltReturn",
    "label": "Step 6: Once you get the completed DV-200 back, make a copy of it for yourself",
    "type": "case_information"
  },
  {
    "id": "AltFile",
    "label": "Step 7: File the original DV-200 with the court. Bring the stamped copy to your court date and keep a copy with you at all times",
    "type": "case_information"
  },
  {
    "id": "Attendhearing",
    "label": "Attend your hearing at the court on the day listed on item 3 on the DV109 you recieved. If you have evidence like pictures, text messages, or emails, you will need to print them out and make three copies of each piece of evidence. One copy is for you, one is for the judge, and one is for the other side. If you have witnesses who can help support your case, bring them with you to your court date.",
    "type": "case_information"
  },
  {
    "id": "DVA1",
    "label": "A DVRO can: Stop contact, harassment, or threats, require the person to stay away, make them move out, restrict firearm access, require support payments, create custody/visitation rules. It can also protect children, pets, and property. Police can enforce a CLETS restraining order.",
    "type": "general_information"
  },
  {
    "id": "DVA2",
    "label": "Yes. There is no court fee to ask for a DVRO. You also do not need a lawyer to file.",
    "type": "case_information"
  },
  {
    "id": "DVA3",
    "label": "Yes. A DVRO may still be helpful because: Criminal cases can be dismissed, and DVROs can include child custody, support, or family protection. You can have both at the same time.",
    "type": "general_information"
  },
  {
    "id": "DVA4",
    "label": "If you ask for a Temporary Restraining Order (TRO), the judge usually decides within 1 business day after you file.",
    "type": "case_information"
  },
  {
    "id": "DVCustody",
    "label": "I want to ask for custody or visitation/parenting time orders",
    "type": "general_information"
  },
  {
    "id": "DVChildSupport",
    "label": "I want to ask for child support",
    "type": "general_information"
  },
  {
    "id": "DVSpousalSupport",
    "label": "I want to ask for spousal support",
    "type": "general_information"
  },
  {
    "id": "AbductionCheck",
    "label": "Do you believe that the other parent may take your child out of the nine Bay Area counties without your permission?",
    "type": "case_information"
  },
  {
    "id": "AbductionCheck2",
    "label": "You can ask the court to protect against this by completing form DV-108 and DV-145.",
    "type": "general_information"
  },
  {
    "id": "Abd3",
    "label": "File the following forms with your DV100: DV-105 (Request for Child Custody and Visitation Orders), and items 2 & 3 on the DV-140 (Child Custody and Visitation Order Attachment), DV-108 (Request for Orders to Prevent Child Abduction), and items 1 and 2 on DV-145 (Order to Prevent Child Abduction)",
    "type": "case_information"
  },
  {
    "id": "DVCustodyInfo",
    "label": "File the following forms with your DV100: DV-105 (Request for Child Custody and Visitation Orders), and items 2 & 3 on the DV-140 (Child Custody and Visitation Order Attachment)",
    "type": "case_information"
  },
  {
    "id": "DVCustodyHelp",
    "label": "How will the court decide custody and parenting time? The judge looks at what is best for the child — safety is the top priority. You can describe the current arrangement and request specific time-share.",
    "type": "case_information"
  },
  {
    "id": "DVChildSupportInfo",
    "label": "If you would like to ask for child support, check number 24 on form DV100. Then fill out and file FL-150 (Income and Expense Declaration) with proof of income (like paystubs) from the past two months.",
    "type": "case_information"
  },
  {
    "id": "DVChildSupportExplain",
    "label": "How is child support calculated? The court looks at both parents’ income and time spent with the child. Support usually goes to the parent who has the child most.",
    "type": "case_information"
  },
  {
    "id": "DVSpousalSupportForms",
    "label": "Check item 25 on DV-100, and complete FL-150 (Income & Expense Declaration) with proof of income (like paystubs) from the past two months. If you are also asking for child support, you only need to fill out the FL-150 once.",
    "type": "case_information"
  },
  {
    "id": "DVSpousalSupportExplain",
    "label": "How is spousal support calculated? The court looks at: The supported spouse’s financial need and the other’s ability to pay. Domestic violence can also be a factor.",
    "type": "case_information"
  },
  {
    "id": "RespStart",
    "label": "If you recieved any of the following forms: DV-109, DV-100, or DV-110, this means someone asked the court for a Domestic Violence Restraining Order against you",
    "type": "general_information"
  },
  {
    "id": "RespCourtDate",
    "label": "Step 2: Review the forms. Check form DV-109, item 3. This tells you the date, time, and location of your court hearing. If you disagree with any part of the request, you must go to court",
    "type": "general_information"
  },
  {
    "id": "RespConsequence",
    "label": "If you do not attend your court date, the judge can grant a restraining order against you that could last up to 5 years",
    "type": "case_information"
  },
  {
    "id": "RespWhatAsked",
    "label": "Step 3: Read form DV-100 to see what the other side is asking for. Look at items 6 through 23",
    "type": "general_information"
  },
  {
    "id": "RespChildCustody",
    "label": "If you have children together, you may have also received forms DV-100 (which asks for custody or parenting time) or a DV-140 (which makes custody or parenting time orders).",
    "type": "case_information"
  },
  {
    "id": "RespTempOrder",
    "label": "Step 4: Read DV-110 carefully to see if the judge granted a Temporary Restraining Order",
    "type": "general_information"
  },
  {
    "id": "BranchTemp",
    "label": "Was a temporary restraining order granted?",
    "type": "case_information"
  },
  {
    "id": "RespFollowOrders",
    "label": "If you recieved a Temporary Restraining Order, you must follow all temporary orders. If you violate them, you could be arrested or charged with a crime",
    "type": "general_information"
  },
  {
    "id": "GunHave",
    "label": "Do you currently own or possess firearms, firearm parts, ammunition, or body armor?",
    "type": "case_information"
  },
  {
    "id": "GunDecision",
    "label": "You must turn them in, sell them, or store them with law enforcement or a licensed dealer within 24 hours of being served with the restraining order",
    "type": "case_information"
  },
  {
    "id": "GunWarning",
    "label": "Do not try to purchase or possess any firearms, ammunition, or body armor while the restraining order is in effect",
    "type": "general_information"
  },
  {
    "id": "GunOptions",
    "label": "You can turn them in to the police, sell them to a licensed dealer, store them with law enforcement or a licensed gun dealer, or transfer ammunition to a licensed ammunition vendor",
    "type": "general_information"
  },
  {
    "id": "GunParts",
    "label": "You must also turn in any firearm receivers or frames, including parts that could be used or easily turned into a receiver or frame",
    "type": "general_information"
  },
  {
    "id": "GunFormPrep",
    "label": "After turning them in, fill out form DV-800 (Receipt for Firearms, Firearm Parts, and Ammunition)",
    "type": "case_information"
  },
  {
    "id": "GunFormFill",
    "label": "Fill out items 1, 2, 7, and your case number on DV-800. The police or licensed gun dealer will complete the rest",
    "type": "case_information"
  },
  {
    "id": "GunOtherForm",
    "label": "If the police or dealer uses a different form instead of DV-800, that is also acceptable",
    "type": "general_information"
  },
  {
    "id": "GunFile",
    "label": "You must file DV-800 or the alternative form with the court within 48 hours of being served. There is no filing fee",
    "type": "case_information"
  },
  {
    "id": "GunFileLocation",
    "label": "Take the original and a copy to the courthouse listed on your court papers. The clerk will file the original and return a stamped copy to you",
    "type": "case_information"
  },
  {
    "id": "GunEnd",
    "label": "Keep a copy of the court-stamped DV-800 or alternate form with you. If you violate this order, you can be arrested or charged with a crime",
    "type": "general_information"
  },
  {
    "id": "RespWantWrite",
    "label": "Would you like to respond in writing to the request before the court date? This is optional, but is a chance to argue your side.",
    "type": "case_information"
  },
  {
    "id": "DVFile",
    "label": "Step 7: File your forms with the court. There is no fee to file",
    "type": "case_information"
  },
  {
    "id": "DV120Start",
    "label": "Step 6: Fill out DV-120 (Response to Request for Domestic Violence Restraining Order). Attach any evidence you already have (photos, texts). If you need more time for evidence, tell the judge at your court date.",
    "type": "case_information"
  },
  {
    "id": "DV120Caution",
    "label": "If you have a criminal case, probation, or were recently arrested, talk to your criminal defense attorney before filing.",
    "type": "general_information"
  },
  {
    "id": "DV120Evidence",
    "label": "When DV-120 is ready, decide if you also need to attach support or custody forms.",
    "type": "general_information"
  },
  {
    "id": "FL150Fill",
    "label": "Fill out FL-150 (Income & Expense Declaration) and attach pay stubs for the last 2 months. File FL-150 with your DV-120",
    "type": "case_information"
  },
  {
    "id": "DV125Check",
    "label": "Did the other side ask for child custody or visitation orders?",
    "type": "case_information"
  },
  {
    "id": "DV125Fill",
    "label": "Fill out DV-125 (Response to Request for Child Custody & Visitation Orders). File DV-125 with your DV-120.",
    "type": "case_information"
  },
  {
    "id": "DVServeResp",
    "label": "Step 8: Have someone else serve your Response papers",
    "type": "case_information"
  },
  {
    "id": "ServeChoose",
    "label": "Choose your server. They must be 18 or older and not part of your case. You cannot serve the papers yourself",
    "type": "case_information"
  },
  {
    "id": "ServeMail",
    "label": "Your server must mail a copy of DV-120 and any other forms you filed, like DV-125 or FL-150",
    "type": "case_information"
  },
  {
    "id": "ServeDV250",
    "label": "Your server must fill out form DV-250 (Proof of Service by Mail). You can help by filling in the top part of the form with the case number and court info",
    "type": "case_information"
  },
  {
    "id": "ServeDV250Sign",
    "label": "Your server fills out how, when, and where they mailed the papers, then signs and dates the form",
    "type": "case_information"
  },
  {
    "id": "ServeFile",
    "label": "Make a copy of the completed DV-250. File the original and copy with the court clerk",
    "type": "case_information"
  },
  {
    "id": "ServeStamp",
    "label": "The court will stamp your copy and return it to you. Keep it with your records and bring it to your court date",
    "type": "general_information"
  },
  {
    "id": "DVREntry",
    "label": "Do you want to change or end a restraining order that is still active?",
    "type": "case_information"
  },
  {
    "id": "DVROrderCheck",
    "label": "Make sure you have a copy of the current restraining order. This will be form DV-130 or, for closed juvenile cases, form JV-255",
    "type": "general_information"
  },
  {
    "id": "DV300Start",
    "label": "Step 1: Fill out DV-300 (Request to Change or End Restraining Order). Explain what you want to change or end, and why",
    "type": "case_information"
  },
  {
    "id": "DV310Start",
    "label": "Step 2: Fill out items 1 and 2 of DV-310 (Notice of Court Hearing and Temporary Order to Change or End Restraining Order). The court will fill out the rest",
    "type": "case_information"
  },
  {
    "id": "CustodyCheck",
    "label": "Are you also asking to change child custody or visitation orders?",
    "type": "case_information"
  },
  {
    "id": "DV305",
    "label": "Also fill out DV-305 (Request to Change Child Custody and Visitation Orders)",
    "type": "case_information"
  },
  {
    "id": "CopyStep",
    "label": "Step 3: Make at least 3 copies of each form. One for the other person, two for you, and the original for the court",
    "type": "general_information"
  },
  {
    "id": "FileStep",
    "label": "Step 4: File your forms with the court. There is no fee to file",
    "type": "case_information"
  },
  {
    "id": "DVServeCheck",
    "label": "Step 5: After filing, you must serve the other side with your request",
    "type": "case_information"
  },
  {
    "id": "DVServeMethod",
    "label": "Check DV-310, item 5c to see if the judge ordered service by mail or in person",
    "type": "general_information"
  },
  {
    "id": "DVServerChoose",
    "label": "Choose someone to serve the papers. They must be 18 or older and not involved in the case. You cannot serve them yourself",
    "type": "case_information"
  },
  {
    "id": "SheriffOption",
    "label": "Do you want the sheriff to serve your papers?",
    "type": "case_information"
  },
  {
    "id": "SheriffServe",
    "label": "Contact the sheriff in the county where the other party lives. Provide them with the forms to serve. They will complete a proof of service form for you",
    "type": "case_information"
  },
  {
    "id": "PersonalServe",
    "label": "Give your server copies of all court papers and a blank proof of service form",
    "type": "case_information"
  },
  {
    "id": "DVServerSafety",
    "label": "If you are concerned about safety, consider using the sheriff to serve instead",
    "type": "case_information"
  },
  {
    "id": "DVProofForm",
    "label": "Use the correct proof of service form: DV-200 for in-person service, DV-250 for service by mail",
    "type": "general_information"
  },
  {
    "id": "DVProofFill",
    "label": "Your server must complete the proof of service form. You can help by filling in the top portion with the case and court information",
    "type": "case_information"
  },
  {
    "id": "DVFileProof",
    "label": "File the completed proof of service form with the court clerk. Make a copy for your records. The court keeps the original and returns a stamped copy",
    "type": "case_information"
  },
  {
    "id": "DVHearingPrep",
    "label": "Keep your copy of the proof of service with your restraining order and bring it to your court hearing",
    "type": "general_information"
  },
  {
    "id": "DVPostHearing",
    "label": "After the hearing, the judge may issue form DV-330 (Order to Change or End Restraining Order)",
    "type": "general_information"
  },
  {
    "id": "DV330Check",
    "label": "Step 6: Does the DV-330 say that you must have a copy served on the other party?",
    "type": "case_information"
  },
  {
    "id": "DVEnd",
    "label": "You do not need to do anything further. If there is an order, be aware of when it expires.",
    "type": "general_information"
  },
  {
    "id": "DV330ServeStart",
    "label": "You must have someone serve the other party in person with a copy of the filed DV-330",
    "type": "case_information"
  },
  {
    "id": "DV330Server",
    "label": "Choose a server. They must be 18 or older and not involved in the case. You may want to ask the sheriff.",
    "type": "case_information"
  },
  {
    "id": "DV330Deliver",
    "label": "Give your server a copy of the filed DV-330. They must deliver it to the other party",
    "type": "case_information"
  },
  {
    "id": "DV330File",
    "label": "File the original and a copy of the proof of service form with the court clerk. Keep the copy for your records",
    "type": "case_information"
  },
  {
    "id": "DVRenewStart",
    "label": "Do you want to renew (extend) a restraining order before it expires?",
    "type": "case_information"
  },
  {
    "id": "DVRCheckDate",
    "label": "Check your current restraining order (DV-130 or DV-730) for the expiration date",
    "type": "general_information"
  },
  {
    "id": "DVRWhoFiled",
    "label": "Are you the protected person listed in item 1 of the order?",
    "type": "case_information"
  },
  {
    "id": "DVRIneligible",
    "label": "Only the protected person can ask to renew the restraining order",
    "type": "general_information"
  },
  {
    "id": "DVRWindowCheck",
    "label": "Is it 3 months or less before your order expires?",
    "type": "case_information"
  },
  {
    "id": "DVRTooSoon",
    "label": "You cannot apply yet. You must wait until you are within 3 months of the expiration date",
    "type": "general_information"
  },
  {
    "id": "DVRExpiredCheck",
    "label": "Has your order already expired?",
    "type": "case_information"
  },
  {
    "id": "DVRExpired",
    "label": "You cannot renew an expired order. You must file for a new restraining order",
    "type": "case_information"
  },
  {
    "id": "DVR700Start",
    "label": "Step 1: Fill out DV-700 (Request to Renew Restraining Order). Explain why you want the protection extended",
    "type": "case_information"
  },
  {
    "id": "DVRAttachOrder",
    "label": "Attach a copy of your current restraining order (DV-130) to your DV-700",
    "type": "general_information"
  },
  {
    "id": "DVR710Start",
    "label": "Step 2: Fill out DV-710 (Notice of Hearing to Renew Restraining Order). The court will assign a hearing date and fill out most of the form",
    "type": "case_information"
  },
  {
    "id": "DVRCLETS",
    "label": "Step 3: Fill out CLETS-001 (Confidential CLETS Information). Only law enforcement will see this",
    "type": "case_information"
  },
  {
    "id": "DVRFileHow",
    "label": "How would you like to file your forms?",
    "type": "case_information"
  },
  {
    "id": "DVRFileCourt",
    "label": "Take your original plus 2 copies to the court clerk. The judge will review your request. The clerk will tell you when to return for your court-stamped papers",
    "type": "general_information"
  },
  {
    "id": "DVRFileEfile",
    "label": "You can fill out and e-file through your court’s website. The court will return the documents electronically",
    "type": "case_information"
  },
  {
    "id": "DVRFileDrop",
    "label": "Place the original and 2 copies in a courthouse drop box. Include a rubber band or envelope. You must return to pick up your papers",
    "type": "general_information"
  },
  {
    "id": "DVRReviewForms",
    "label": "Step 4: Review your returned forms. Look at DV-710 for your court date",
    "type": "general_information"
  },
  {
    "id": "DVRServePrep",
    "label": "Step 5: You must now serve the other person with your renewal papers. Someone 18 or older (not you, or someone in the case) must hand-deliver them before the deadline. The sheriff or another adult can do this",
    "type": "case_information"
  },
  {
    "id": "DVRServeWho",
    "label": "Would you like the sheriff to serve your papers for you? (You must have the person’s address or usual location)",
    "type": "case_information"
  },
  {
    "id": "DVRSERStart",
    "label": "Step 1: Fill out SER-001 (Request for Sheriff to Serve Court Papers)",
    "type": "case_information"
  },
  {
    "id": "DVRSER1",
    "label": "SER-001, Item 4: List every address and the times the person is likely to be there",
    "type": "general_information"
  },
  {
    "id": "DVRSER3",
    "label": "Item 5c: Court hearing date — use the date in DV-710, item 3",
    "type": "general_information"
  },
  {
    "id": "DVRSER4",
    "label": "Item 5d: Deadline to serve — see DV-710, item 4, then count backwards from the hearing date",
    "type": "case_information"
  },
  {
    "id": "DVRSERSoon",
    "label": "Contact the sheriff ASAP by phone, email, or in person — it can take days for them to attempt service",
    "type": "general_information"
  },
  {
    "id": "DVRSERGather",
    "label": "Step 2: Gather papers for the sheriff",
    "type": "general_information"
  },
  {
    "id": "DVRSERPacket",
    "label": "You will need: Completed SER-001, DV-700, DV-710, blank DV-720",
    "type": "case_information"
  },
  {
    "id": "DVRSERDeliver",
    "label": "Step 3: Deliver your packet to the sheriff (in person, by email, or fax — ask your county sheriff for instructions)",
    "type": "general_information"
  },
  {
    "id": "DVRSERConfirm",
    "label": "Step 4: Confirm the sheriff received everything and knows the deadline",
    "type": "general_information"
  },
  {
    "id": "DVRSheriffReturn",
    "label": "Did the sheriff give you Proof of Service?",
    "type": "case_information"
  },
  {
    "id": "DVRSheriffServed",
    "label": "Sheriff served the other side — you’ll get a completed Proof of Service form",
    "type": "case_information"
  },
  {
    "id": "DVRSheriffFailed",
    "label": "Sheriff couldn’t serve — they’ll give you a Declaration of Due Diligence",
    "type": "case_information"
  },
  {
    "id": "DVRSheriffCheck",
    "label": "If you get no paperwork back, call the sheriff right away. If service won’t be done in time, ask the court to move the hearing date",
    "type": "case_information"
  },
  {
    "id": "DVRSheriffFiling",
    "label": "File the original Proof of Service (or Due Diligence) with the court. If it’s already court-stamped, filing is done",
    "type": "case_information"
  },
  {
    "id": "DVRSheriffCopy",
    "label": "Bring a copy to your hearing. If the order is renewed and CLETS-registered, police can enforce it",
    "type": "general_information"
  },
  {
    "id": "DVRAltStart",
    "label": "Step 1: Choose your server (18+, not in the case). You can’t serve papers yourself",
    "type": "case_information"
  },
  {
    "id": "DVRAltSafety",
    "label": "If it may be dangerous for someone you know to serve, consider the sheriff instead",
    "type": "case_information"
  },
  {
    "id": "DVRAltDeadline",
    "label": "Step 2: Check your service deadline — see DV-710, item 4**, and count backwards",
    "type": "general_information"
  },
  {
    "id": "DVRAltPapers",
    "label": "Step 3: Give your server DV-700, DV-710, blank DV-720, and any local forms",
    "type": "case_information"
  },
  {
    "id": "DVRAltDV200",
    "label": "Step 4: Fill out DV-200 (Proof of Personal Service) items 1-3; your server fills the rest after delivery",
    "type": "case_information"
  },
  {
    "id": "DVRAltServe",
    "label": "Step 5: Ask your server to deliver the papers ASAP and before the deadline; they must complete DV-200 and return it to you",
    "type": "case_information"
  },
  {
    "id": "DVRAltRefuse",
    "label": "If the other side refuses the papers, the server may leave them nearby and note that on DV-200",
    "type": "general_information"
  },
  {
    "id": "DVRAltReturn",
    "label": "Step 6: Make a copy of the completed DV-200 for yourself",
    "type": "case_information"
  },
  {
    "id": "DVRAltFile",
    "label": "Step 7: File the original DV-200 with the court. Bring the stamped copy to your hearing and keep a copy with you",
    "type": "case_information"
  },
  {
    "id": "DVRProtectionDate",
    "label": "Your current restraining order is automatically extended until your court hearing",
    "type": "general_information"
  },
  {
    "id": "DVRJudgeDecision",
    "label": "At the court date, the judge will decide whether to renew the restraining order for 5 years or permanently",
    "type": "general_information"
  },
  {
    "id": "subGraph1",
    "label": "Triage Restraining Order",
    "type": "general_information"
  },
  {
    "id": "TriageRO",
    "label": "Unsure what restraining order you need?",
    "type": "case_information"
  },
  {
    "id": "Start",
    "label": "What is your relationship to the person you want protection from?",
    "type": "case_information"
  },
  {
    "id": "CloseRel",
    "label": "Are they someone you are/were dating, married to, have a child with, or a close family member (parent, sibling, grandparent, in-law)?",
    "type": "case_information"
  },
  {
    "id": "DVROEntry",
    "label": "You may qualify for a Domestic Violence Restraining Order",
    "type": "general_information"
  },
  {
    "id": "ElderAge",
    "label": "Are you 65 or older, or between 18–64 with a disability?",
    "type": "case_information"
  },
  {
    "id": "EARO",
    "label": "You may qualify for an Elder or Dependent Adult Abuse Restraining Order",
    "type": "general_information"
  },
  {
    "id": "CROInfo",
    "label": "Is the harm done by someone you are NOT closely related to, for example, a neighbor, roommate, or stranger?",
    "type": "case_information"
  },
  {
    "id": "CRO",
    "label": "You may qualify for a Civil Harassment Restraining Order",
    "type": "general_information"
  },
  {
    "id": "CRONO",
    "label": "Please go to the Self-Help Center to get infomration on other types of restraining order",
    "type": "case_information"
  },
  {
    "id": "subGraph2",
    "label": "Civil Restraining Order",
    "type": "general_information"
  },
  {
    "id": "Starting",
    "label": "Start a Civil Harassment Restraining order",
    "type": "general_information"
  },
  {
    "id": "CHRO",
    "label": "Civil Harassment Restraining Order",
    "type": "general_information"
  },
  {
    "id": "CROStart",
    "label": "What do you need help with?",
    "type": "case_information"
  },
  {
    "id": "Responding",
    "label": "Responding to a Civil Harassment Restraining order",
    "type": "general_information"
  },
  {
    "id": "Renew",
    "label": "Renew a Civil Harassment Restraining order",
    "type": "general_information"
  },
  {
    "id": "CHROGrounds",
    "label": "It can be granted if the person has harassed, stalked, threatened, or harmed you emotionally or physically.",
    "type": "general_information"
  },
  {
    "id": "CHROAgeCheck",
    "label": "Are you 12 or older?",
    "type": "case_information"
  },
  {
    "id": "CHROMinorNote",
    "label": "If you are under 12, a trusted adult must file for you. Please visit the Self-Help Center in-person or online via LiveChat.",
    "type": "general_information"
  },
  {
    "id": "CHROWhatItDoes",
    "label": "A judge can make orders to protect you, your family, and your pets. Police can enforce it once granted.",
    "type": "general_information"
  },
  {
    "id": "CHROFormsStart",
    "label": "Step 1: Fill out the required court forms to ask for a restraining order",
    "type": "case_information"
  },
  {
    "id": "CHROFormList",
    "label": "You will need to complete these five forms: CH-100, CLETS-001, CH-109, CH-110, and CM-010",
    "type": "case_information"
  },
  {
    "id": "CH100",
    "label": "CH-100: Request for Civil Harassment Restraining Orders. Explain what happened, what orders you want, and if you need protection right away (item 11)",
    "type": "general_information"
  },
  {
    "id": "CH100FeeWaiver",
    "label": "If there was violence, stalking, or threats of violence, check item 13a to ask the court to waive the filing fee",
    "type": "general_information"
  },
  {
    "id": "CLETS",
    "label": "CLETS-001: Confidential CLETS Information. This helps law enforcement. The other person will not see this form",
    "type": "general_information"
  },
  {
    "id": "CH109",
    "label": "CH-109: Notice of Court Hearing. You complete items 1 and 2. The rest will be filled out by the court",
    "type": "case_information"
  },
  {
    "id": "CH110",
    "label": "CH-110: Temporary Restraining Order. Only complete this form if you are asking for protection right away. Fill out items 1, 2, and 3",
    "type": "case_information"
  },
  {
    "id": "CM010",
    "label": "CM-010: Civil Case Cover Sheet. Tells the court the type of case you are filing",
    "type": "general_information"
  },
  {
    "id": "CHROCopies",
    "label": "After completing and signing your forms, make two copies of everything before you file them",
    "type": "case_information"
  },
  {
    "id": "CHROFilingStart",
    "label": "Step 2: File your forms with the court",
    "type": "case_information"
  },
  {
    "id": "CHROWhere",
    "label": "Not every courthouse accepts these papers. Check your court’s website or ask the Self-Help Center where to file your CHRO forms",
    "type": "case_information"
  },
  {
    "id": "CHROHow",
    "label": "Take your original and two copies to the court clerk. They will stamp your copies and send the original to a judge for review",
    "type": "general_information"
  },
  {
    "id": "CHROFee",
    "label": "If you are not alleging violence, stalking, or threats of violence, and you did not request a fee waiver, you must pay a filing fee of $435–$450",
    "type": "general_information"
  },
  {
    "id": "CHROFeeDenied",
    "label": "If you asked for a fee waiver and it was denied, talk to the clerk or Self-Help Center about what to do next",
    "type": "general_information"
  },
  {
    "id": "CHROPickup",
    "label": "If you asked for a temporary restraining order, a judge may review your forms the same day. Ask the clerk when you should return to pick up your papers",
    "type": "general_information"
  },
  {
    "id": "CHROReviewStart",
    "label": "Step 3: Pick up your papers and read the judge’s orders carefully",
    "type": "general_information"
  },
  {
    "id": "CHROCheckDate",
    "label": "Check form CH-109 to find your court date and location",
    "type": "general_information"
  },
  {
    "id": "CHROCheckTRO",
    "label": "Did the judge sign form CH-110 (Temporary Restraining Order)?",
    "type": "case_information"
  },
  {
    "id": "CHROTROGranted",
    "label": "You now have a Temporary Restraining Order. It lasts until your court date",
    "type": "general_information"
  },
  {
    "id": "CHROCopyAdvice",
    "label": "Keep a copy of CH-110 with you at all times. You can also take a photo of it on your phone in case you need to show police",
    "type": "general_information"
  },
  {
    "id": "CHRONoTRO",
    "label": "The judge did not grant a temporary restraining order, but you still have a court date where the judge can grant a long-term order",
    "type": "general_information"
  },
  {
    "id": "RenewIntro",
    "label": "Do you still need protection once your current order (CH-130) ends? You can ask the judge to renew it for up to 5 more years",
    "type": "case_information"
  },
  {
    "id": "RenewWindow",
    "label": "Is it 3 months or less before the order’s expiration date listed on CH-130, item 4?",
    "type": "case_information"
  },
  {
    "id": "RenewTooSoon",
    "label": "You must wait until you’re within 3 months of the expiration date to apply",
    "type": "general_information"
  },
  {
    "id": "CopiesRenew",
    "label": "Make at least 2 copies of everything (one for you, one for the restrained person)",
    "type": "general_information"
  },
  {
    "id": "FileRenew",
    "label": "Take the original + copies to the court clerk. They’ll file the papers and set your hearing date. Your order is extended until that date",
    "type": "case_information"
  },
  {
    "id": "ServeRenewPrep",
    "label": "Step 2: Serve the other side with your renewal request",
    "type": "case_information"
  },
  {
    "id": "SheriffAskRenew",
    "label": "Would you like the sheriff to serve the papers for you? You must provide an address or location",
    "type": "case_information"
  },
  {
    "id": "SERRenewStart",
    "label": "Fill out SER-001 (Request for Sheriff to Serve Court Papers)",
    "type": "case_information"
  },
  {
    "id": "AltRenewStart",
    "label": "Choose another adult (18+, not in the case) or a professional process server",
    "type": "case_information"
  },
  {
    "id": "SERRenewGather",
    "label": "Gather CH-700 including a copy of your current order (Ch-130), CH-710, blank CH-720, and SER-001 for the sheriff",
    "type": "general_information"
  },
  {
    "id": "AltRenewGather",
    "label": "Give your server CH-700 including a copy of your current order (Ch-130), CH-710, blank CH-720, and any other required papers",
    "type": "case_information"
  },
  {
    "id": "ServeDeadlineRenew",
    "label": "Check CH-710 #4 to calculate the service deadline (count back the listed days from the hearing date)",
    "type": "general_information"
  },
  {
    "id": "ProofRenew",
    "label": "Get Proof of Service (or Declaration of Due Diligence) from your server and make sure it’s filed with the court before your hearing",
    "type": "case_information"
  },
  {
    "id": "PrepRenew",
    "label": "Step 3: Prepare for court — bring copies of all papers, any evidence of violations, and notes of what you plan to say",
    "type": "general_information"
  },
  {
    "id": "CourtRenew",
    "label": "Step 4: Go to court on the date in CH-710",
    "type": "general_information"
  },
  {
    "id": "JudgeDecisionRenew",
    "label": "The judge decides whether to renew the order",
    "type": "general_information"
  },
  {
    "id": "CH730",
    "label": "Fill out (or review if the clerk prepared it for you) CH-730 (Order Renewing Civil Harassment Restraining Order). Give your CH-730 and attahced restraining order to the clerk so the judge can sign it. Ask for two copies of the filed order.",
    "type": "case_information"
  },
  {
    "id": "ServeNewOrder",
    "label": "Step 5: Serve the renewed order on the restrained person (you cannot servce it yourself) and file the signed Proof of Service with the court",
    "type": "case_information"
  },
  {
    "id": "RenewEndNo",
    "label": "The order is not renewed and will expire on its original date",
    "type": "general_information"
  },
  {
    "id": "RenewEndYes",
    "label": "Your restraining order is renewed. Keep a copy with you at all times",
    "type": "general_information"
  },
  {
    "id": "RC0",
    "label": "If you received CH-109, CH-100, or CH-110, someone asked the court for a Civil Harassment Restraining Order against you",
    "type": "general_information"
  },
  {
    "id": "RCDate",
    "label": "Step 1: Check CH-109 (Notice of Court Hearing) for your court date, time, and location",
    "type": "general_information"
  },
  {
    "id": "RCReadReq",
    "label": "Step 2: Read CH-100 to see which orders the other side wants (items 8-16)",
    "type": "general_information"
  },
  {
    "id": "RCTRO",
    "label": "Step 3: Did the judge sign CH-110 (Temporary Restraining Order)?",
    "type": "case_information"
  },
  {
    "id": "RCTROYes",
    "label": "Follow every order in CH-110 right away. Violating it can lead to arrest",
    "type": "general_information"
  },
  {
    "id": "CHGunHave",
    "label": "Do you currently own or possess firearms, firearm parts, ammunition, or body armor?",
    "type": "case_information"
  },
  {
    "id": "CHGunDecision",
    "label": "You must turn them in, sell them, or store them with law enforcement or a licensed dealer within 24 hours of being served with the restraining order",
    "type": "case_information"
  },
  {
    "id": "CHGunWarning",
    "label": "Do not try to purchase or possess any firearms, ammunition, or body armor while the restraining order is in effect",
    "type": "general_information"
  },
  {
    "id": "CHGunOptions",
    "label": "You can turn them in to the police, sell them to a licensed dealer, store them with law enforcement or a licensed gun dealer, or transfer ammunition to a licensed ammunition vendor",
    "type": "general_information"
  },
  {
    "id": "CHGunParts",
    "label": "You must also turn in any firearm receivers or frames, including parts that could be used or easily turned into a receiver or frame",
    "type": "general_information"
  },
  {
    "id": "CHGunFormPrep",
    "label": "After turning them in, fill out form CH-800 (Receipt for Firearms, Firearm Parts, and Ammunition)",
    "type": "case_information"
  },
  {
    "id": "CHGunFormFill",
    "label": "Fill out items 1, 2, 7, and your case number on CH-800. The police or licensed gun dealer will complete the rest",
    "type": "case_information"
  },
  {
    "id": "CHGunOtherForm",
    "label": "If the police or dealer uses a different form instead of CH-800, that is also acceptable",
    "type": "general_information"
  },
  {
    "id": "CHGunFile",
    "label": "You must file the CH-800 or the alternative form with the court within 48 hours of being served. There is no filing fee",
    "type": "case_information"
  },
  {
    "id": "CHGunFileLocation",
    "label": "Take the original and a copy to the courthouse listed on your court papers. The clerk will file the original and return a stamped copy to you",
    "type": "case_information"
  },
  {
    "id": "CHGunEnd",
    "label": "Keep a copy of the court-stamped CH-800 or alternate form with you. If you violate this order, you can be arrested or charged with a crime",
    "type": "general_information"
  },
  {
    "id": "RCRespondOpt",
    "label": "Would you like to respond in writing before court? (Optional)",
    "type": "case_information"
  },
  {
    "id": "CH120Start",
    "label": "Step 4: Fill out CH-120 (Response). Attach any evidence (photos, texts, emails)",
    "type": "case_information"
  },
  {
    "id": "CopyResp",
    "label": "Make 2 copies of your signed CH-120",
    "type": "general_information"
  },
  {
    "id": "FeeWaiverQ",
    "label": "Do you need a fee waiver? (No fee if CH-100 item 13a is checked)",
    "type": "case_information"
  },
  {
    "id": "FeeWaiverForms",
    "label": "Fill out and file FW-001 (Request to Waive Court Fees) and items 1-2 of FW-003 (Order). You may qualify if you: get public benefits, have household income below the FW-001 guideline, or can’t meet basic needs and pay the fee",
    "type": "case_information"
  },
  {
    "id": "FileResp",
    "label": "File the original + copies at the courthouse on CH-109. No money is due if item 13a was checked **or** your waiver is granted. Otherwise, you need to pay the $435–450 filing fee.",
    "type": "case_information"
  },
  {
    "id": "ServePrep",
    "label": "Step 5: Have someone 18+ (not you) mail a copy of CH-120 to the other side",
    "type": "general_information"
  },
  {
    "id": "CH250Form",
    "label": "Your server completes CH-250 (Proof of Service by Mail)",
    "type": "case_information"
  },
  {
    "id": "FileProof",
    "label": "File the original CH-250 with the court and keep a stamped copy",
    "type": "case_information"
  },
  {
    "id": "PrepCourt",
    "label": "Step 6: Prepare for court — bring 3 copies of each piece of evidence, any witnesses, and notes of what you’ll tell the judge",
    "type": "general_information"
  },
  {
    "id": "CourtDate",
    "label": "Step 7: Go to court on the date in CH-109. The judge will decide whether to grant the restraining order",
    "type": "general_information"
  },
  {
    "id": "AltTRO",
    "label": "If you were granted a Temporary Restraining Order (DV-110), the restrained person can be arrested if they vio…",
    "type": "case_information"
  },
  {
    "id": "DV100f",
    "label": "If you don't remember the exact date, estimate and explain (e.g., 'Around August 2020')",
    "type": "general_information"
  },
  {
    "id": "DVA5",
    "label": "Yes, if you’re 12 or older, you can file on your own.",
    "type": "case_information"
  },
  {
    "id": "DVA6",
    "label": "Domestic violence is a pattern of behaviors used to gain or maintain power and control through:     - physica…",
    "type": "general_information"
  },
  {
    "id": "DVMinor",
    "label": "If you're under 12, a trusted adult must help you file.",
    "type": "case_information"
  },
  {
    "id": "DVPickup",
    "label": "Ask the clerk when your papers will be ready and how you'll be notified.",
    "type": "case_information"
  },
  {
    "id": "DVQ5",
    "label": "Can I get a DVRO if I'm under 18?",
    "type": "general_information"
  },
  {
    "id": "DVQA",
    "label": "What if I don't remember the exact dates?",
    "type": "general_information"
  },
  {
    "id": "DVRSER2",
    "label": "SER-001, Item 5a: Type of papers — write 'Renew Domestic Violence Restraining Order'",
    "type": "case_information"
  },
  {
    "id": "DVTiming",
    "label": "Note: If you file for a Domestic Violence Restraining Order before noon, you should get a response from the c…",
    "type": "case_information"
  },
  {
    "id": "FL150Check",
    "label": "Did the other side ask for child support, spousal support, or attorney's fees?",
    "type": "case_information"
  },
  {
    "id": "Note",
    "label": "If you'd like specialized in-person help, San Mateo County offers in-person help for restraining orders Monda…",
    "type": "general_information"
  },
  {
    "id": "RespCheckForms",
    "label": "Step 1: Know what the forms mean.",
    "type": "case_information"
  },
  {
    "id": "SER2",
    "label": "Item 5a: Type of court papers.",
    "type": "case_information"
  },
  {
    "id": "SERDeliver",
    "label": "Step 3: Deliver your forms to the sheriff in person or via email or fax.",
    "type": "case_information"
  },
  {
    "id": "SERSoon",
    "label": "Contact the sheriff's office as soon as possible via email, phone or in-person services.",
    "type": "case_information"
  },
  {
    "id": "SheriffCheck",
    "label": "If you do not get any paperwork back, contact the sheriff's office right away to ask if they served the other…",
    "type": "case_information"
  },
  {
    "id": "SheriffFiling",
    "label": "Make sure the original Proof of Service or Declaration of Due Diligence is filed with the court.",
    "type": "case_information"
  }
]
