{
  "id": "divorce-flow",
  "version": "2025-08-14",
  "start": "A",
  "metadata": {
    "title": "Divorce / Dissolution / Legal Separation",
    "jurisdiction": "CA",
    "source": "Mermaid Divorce flow",
    "flow_family": "Divorce",
    "direction": "TB",
    "subgraphs": ["FILE", "SUMD", "SERVE", "PDD_PET", "RESPOND", "FINALIZE_CHOOSER", "FINALIZE", "RFO", "EX_PARTE", "MOVE", "RESP_PDD"]
  },
  "nodes": {
    "A": { "type": "decision", "text": "Start Here: What do you need help with?" },
    "A1": { "type": "process", "text": "Filing for a Divorce/Dissolution/Legal Separation" },
    "A1a": { "type": "process", "text": "Serving Your Spouse" },
    "A2": { "type": "process", "text": "Responding to a Divorce" },
    "Pet_Start": { "type": "process", "text": "Deciding How to Finalize Your Divorce" },
    "A3": { "type": "process", "text": "Moving Your Case Forward" },
    "A5": { "type": "process", "text": "File an Emergency Request" },
    "A6": { "type": "process", "text": "File a Request For Order" },

    "A0b": { "type": "decision", "text": "Do you believe your marriage or domestic partnership is legally valid?" },
    "A0": { "type": "decision", "text": "Do you want child custody or support orders?" },
    "ANN_DEF": { "type": "process", "text": "An annulment (nullity) is a legal way to have a court say your marriage or domestic partnership was never valid. In California, there are 2 types:\n        - Void marriages — always invalid:\n            • Incest — between close blood relatives (parent-child, siblings, aunt/uncle–niece/nephew)\n            • Bigamy — marriages where one person is already married to someone else (unless that spouse was thought dead)\n        - Voidable marriages — can be invalid if a judge annuls them:\n            • Under 18 at the time of marriage\n            • Fraud — tricked into marriage\n            • Unsound mind — lacked mental capacity\n            • Physical incapacity to consummate the marriage\n            • Bigamy with spouse thought dead (absent ≥5 years or presumed dead) who turns out alive\n            • Forced into marriage\n        Some reasons have strict filing deadlines (often 4 years)." },
    "ANN_NOTE": { "type": "process", "text": "Annulments are legally complex and fact-specific. Even if you don’t see your situation here, you may still qualify. Visit the court’s Self-Help Center or talk to a lawyer before proceeding." },
    "A0_YES_DIV": { "type": "process", "text": "You can request custody and support orders within your divorce or legal separation case — no separate case is required." },
    "CUST_ONLY": { "type": "process", "text": "You can start a separate custody/support case." },
    "AR": { "type": "decision", "text": "Have you (or your spouse) lived in California for the past 6 months AND in this county for the past 3 months?" },
    "SD0": { "type": "decision", "text": "Do you want to check if you qualify for a simpler divorce process (Summary Dissolution)?" },

    "VEN0": { "type": "decision", "text": "Does either spouse meet California's 6-month residency somewhere in California?" },
    "VEN1": { "type": "decision", "text": "Does either spouse meet the 3-month residency in any California county?" },
    "VEN2": { "type": "process", "text": "You may file for divorce in any California county where either spouse has lived for the past 3 months (proper venue there). The filing steps below still apply—file your forms in that county." },
    "VEN3": { "type": "process", "text": "Option A: Wait until a spouse reaches 3 months in a county, then file there.  Option B: File for legal separation now (no time requirement) and later amend to divorce once residency is met." },
    "LS_EXPL": { "type": "process", "text": "In a legal separation, you stay married but the court divides your property and debts and makes orders about financial support. The court can also make orders about child custody, visitation, and support." },
    "LS_STEPS": { "type": "process", "text": "To get legally separated, you use the same steps as divorce in California (same forms, check box for legal separation in Petition)." },
    "LSC2": { "type": "decision", "text": "Does at least one spouse currently live in California?" },
    "LSEP": { "type": "process", "text": "You can't file for divorce in California yet. You may file for legal separation now in any California county where either spouse currently lives (no time requirement). You can amend to divorce once the 6-month/3-month residency is met." },
    "NoLS": { "type": "process", "text": "While there's no time requirement, at least one spouse must live in California to file for legal separation. Consider filing in a state/country where residency is met, or wait until residency is met in California." },

    "SD2": { "type": "decision", "text": "Do you have any children together or is either of you pregnant?" },
    "SD3": { "type": "decision", "text": "Do either of you own or lease any real estate (like a house, land, or building)?" },
    "SD3a": { "type": "decision", "text": "Is it a rental where the lease ends within 1 year of filing?" },
    "SD4": { "type": "decision", "text": "Do you owe less than $7,000 in debt (not including car loans) from during the marriage?" },
    "SD5": { "type": "decision", "text": "Is your community property (shared during marriage) worth less than $57,000 (excluding cars)?" },
    "SD6": { "type": "decision", "text": "Is your separate property (owned before marriage or after separation) each worth less than $57,000, including retirement accounts?" },
    "SD7": { "type": "decision", "text": "Do you both agree to: End the marriage/partnership, waive spousal support, and sign a property/debt agreement?" },
    "SDfail": { "type": "process", "text": "You do not qualify for Summary Dissolution — proceed with standard divorce steps" },

    "B1": { "type": "process", "text": "Carefully fill out a Petition (FL-100) and Summons (FL-110) to start your case" },
    "B2": { "type": "process", "text": "Consider filling out a Fee Waiver Request (FW-001) and Order (FW-003) if the filing fee ($435-$450) will pose a financial difficulty for you" },
    "B3": { "type": "decision", "text": "Do you have children (under 18) with your spouse?" },
    "B4": { "type": "process", "text": "Fill out Child Custody Declaration (FL-105)" },
    "FL2": { "type": "process", "text": "Fill out Alternative Dispute Resolution (ADR) Options (FL-2)" },
    "B5a": { "type": "process", "text": "Make 2 copies of all of your forms" },
    "BRV1": { "type": "process", "text": "Recommended: Have Self-Help Center/FLF review your forms (Petition, Summons, FL-105 if any) before filing to avoid rejections and amendment delays" },
    "B5": { "type": "process", "text": "File with the court the original and 2 copies of:\n    - the Petition (FL-100)\n    - Summons (FL-110)\n    - ADR Options (FL-2)\n    - If you have minor children, (FL-105)\n    - If you want a fee waiver, Fee Waiver Request (FW-001) and Order (FW-003)" },

    "SD8": { "type": "process", "text": "You qualify for Summary Dissolution. You must complete a joint agreement and wait 6 months for final judgment." },
    "SD10": { "type": "process", "text": "Step 1: Read Summary Dissolution Information (form FL-810)" },
    "SD11": { "type": "process", "text": "You are required to read FL-810 before you sign the paperwork. It explains all required steps." },
    "S11a": { "type": "process", "text": "Note: Either of you can cancel the process during the 6-month waiting period by filing form FL-830 (Notice of Revocation)" },
    "SD12": { "type": "process", "text": "Step 2: Each of you must complete financial disclosures:" },
    "SD13": { "type": "process", "text": "Fill out: FL-150 (Income & Expense Declaration)" },
    "SD14": { "type": "process", "text": "You'll need: 2 months of paystubs and your most recent tax return" },
    "SD15": { "type": "decision", "text": "You have two options for disclosing property & debts" },
    "SD15a": { "type": "process", "text": "Option A: Use FL-140 (Declaration of Disclosure), and either FL-142 or FL-160" },
    "SD15b": { "type": "process", "text": "Option B: Use worksheets from FL-810 booklet: Community Property Worksheet, Separate Property Worksheet, Debts/Obligations Worksheet" },
    "SD17": { "type": "process", "text": "Step 3: Share financial disclosures with your spouse or partner" },
    "SD18": { "type": "process", "text": "Each of you must give your spouse:\n    - All forms from Step 2 (financial disclosures)\n    - Tax returns from the last 2 years\n    - Info about any investments, businesses, or other income" },
    "SD19": { "type": "process", "text": "Step 4: Fill out required court forms" },
    "SD20": { "type": "process", "text": "Fill out and sign FL-800 (Joint Petition for Summary Dissolution) — both of you must sign" },
    "SD21": { "type": "process", "text": "Fill out FL-825 (Judgment and Notice of Entry of Judgment)" },
    "SD22": { "type": "process", "text": "Complete only the top section (caption box)" },
    "SD23": { "type": "process", "text": "If either of you is asking to restore a former name, check the correct box and write the full former name" },
    "SD24": { "type": "process", "text": "On page 2, list both of your mailing addresses — the court fills out the rest" },
    "SD25": { "type": "process", "text": "Step 5: Create a written property agreement IF there are community assets or property to divide. This is optional - if you do not have property to divide, you do not need to write a property agreement since your FL-800 will reflect that." },
    "SD26": { "type": "process", "text": "If you need to divide assets or property, you can write your own property agreement or use a template — both of you must sign and date it" },
    "SD27": { "type": "process", "text": "Attach the signed property agreement to form FL-825" },
    "SD28": { "type": "process", "text": "Recommended: Brief document review with Self-Help Center/FLF before filing your FL-800/FL-825 (and any agreement/worksheets)" },
    "SD29": { "type": "process", "text": "Step 6: Make 2 copies of: FL-800, FL-825, and if completed, your property agreement" },
    "SD30": { "type": "process", "text": "Step 7: File forms with the court clerk" },
    "SD31": { "type": "process", "text": "Take your original forms and 2 copies of: FL-800, FL-825, and if completed, your property agreement" },
    "SD32": { "type": "process", "text": "Bring 2 self-addressed stamped envelopes — one for each spouse" },
    "SD33": { "type": "process", "text": "File everything at the clerk's office" },
    "SD34": { "type": "process", "text": "The clerk will: Keep the original FL-800, stamp and return the copies, either return FL-825 now or mail it later" },
    "SD35": { "type": "process", "text": "Ask the clerk how your court will handle judgment delivery" },
    "SD36": { "type": "process", "text": "Step 8: Pay the filing fee ($435-$450) or request a fee waiver" },
    "SD37": { "type": "process", "text": "If one of you qualifies for a fee waiver and the other does not, the one who doesn’t qualify must pay the full fee" },
    "SD38": { "type": "process", "text": "Step 9: Wait for final divorce judgment" },
    "SD39": { "type": "process", "text": "If you don’t receive FL-825 right away, it will be mailed to you later" },
    "SD40": { "type": "process", "text": "Your judgment will be signed by a judge and will have a date on it 6 months from the day you filed. This is the day your divorce would become final, you cannot remarry before that date" },

    "S0": { "type": "process", "text": "What is 'service'?" },
    "S0a": { "type": "process", "text": "Service means delivering legal papers to your spouse and proving it. Once served correctly, your spouse has 30 days to respond." },
    "S1": { "type": "decision", "text": "Where does your spouse live?" },
    "S1a": { "type": "process", "text": "Talk to Self-Help in person or LiveChat — special rules apply" },
    "CA1": { "type": "decision", "text": "Can you arrange personal service by an adult (18+, not you)?" },
    "OOS1": { "type": "decision", "text": "Can you arrange personal service where they are (adult 18+, not you)?" },
    "Service_Alternate": { "type": "process", "text": "There are ways of serving if you don't know where your spouse lives. Speak with the Self-Help Center for more information." },

    "P1": { "type": "process", "text": "Personal Service - Your server can be a:\n        - Friend/relative (18+)\n        - Sheriff/Marshal — FREE with a granted fee waiver (bring FW-003)\n        - Licensed process server" },
    "P6": { "type": "process", "text": "Server must hand the papers to your spouse:\n        - Copies of filed forms (not a fee waiver)\n        - Blank FL-120 (Response)\n        - Any other required blanks" },
    "P7": { "type": "process", "text": "If your spouse refuses to take them, the server may leave them within reach in their presence (drop service) AND state they're legal papers" },
    "P10": { "type": "process", "text": "Have the server complete and sign FL-115 (Proof of Service of Summons)" },
    "P10a": { "type": "process", "text": "Make 2 copies of FL-115" },
    "PSRev": { "type": "process", "text": "Recommended: Quick Self-Help/FLF check — confirm FL-115 matches date/time/place (and any refusal/drop-service note)" },
    "P12": { "type": "process", "text": "File original and copies with the court. Keep a copy for your records." },

    "P1O": { "type": "process", "text": "Use an adult in that state (friend/relative/processor). Sheriffs in CA generally won’t serve out of state." },

    "S2a": { "type": "decision", "text": "Is your spouse cooperative with the divorce process?" },
    "MAIL": { "type": "process", "text": "Out of state and can’t do personal service" },
    "MAIL_NAR": { "type": "process", "text": "Serve by mail with FL-117 (Notice & Acknowledgment of Receipt)" },

    "OOS_A1": { "type": "process", "text": "Pick a server (18+, not you) who lives in the U.S." },
    "OOS_A2": { "type": "process", "text": "Prepare FL-117: Fill in case info, list spouse in item 1, and check the boxes in item 4" },
    "OOS_A3": { "type": "process", "text": "Include a stamped return envelope addressed to your server so your spouse can send back the signed FL-117" },
    "OOS_A4": { "type": "process", "text": "Server fills in mailing date and signs FL-117 (items 2–3), makes a copy for records" },
    "OOS_A5": { "type": "process", "text": "Server mails:\n    - Copies of all filed forms (except fee waiver)\n    - Blank FL-120\n    - Two copies of the FL-117\n    - Return envelope to the server" },
    "OOS_A6": { "type": "process", "text": "Wait up to 30 days for the signed FL-117 to be mailed back to your server" },
    "OOS_A7": { "type": "process", "text": "Complete FL-115 (Proof of Service of Summons) and attach signed FL-117. Server signs and dates FL-115." },
    "OOS_A8": { "type": "process", "text": "Make 2 copies of FL-115 and signed FL-117" },

    "OOS_M2": { "type": "process", "text": "Serve by Certified Mail with a  Return Receipt Requested (RRR)" },
    "OOS_B1": { "type": "process", "text": "Pick a server (18+, not you) who will mail the papers" },
    "OOS_B2": { "type": "process", "text": "Server mails:\n    - Copies of filed forms (except fee waiver)\n    - Blank FL-120\nby Certified Mail with Return Receipt Requested to your spouse’s out-of-state address" },
    "OOS_B3": { "type": "process", "text": "Wait for the green card (return receipt) signed by your spouse to come back to your server" },
    "OOS_B4": { "type": "process", "text": "Server completes FL-115 and attaches:\n    - The signed green card\n    - A short declaration stating when/where they mailed the papers" },
    "OOS_B5": { "type": "process", "text": "Make 2 copies of FL-115 with Return Receipt attached" },
    "MSRev": { "type": "process", "text": "Recommended: Have the Self-Help Center/FLF review your service was done correctly" },
    "OOS_B6": { "type": "process", "text": "File the original FL-115 with attachments:\n    – FL-117 (signed) if you used Notice & Acknowledgment of Receipt\n    – Green card + mailing declaration if you used Certified Mail RRR.\n    Keep copies for your records." },

    "PDD": { "type": "process", "text": "Step 3: Complete Preliminary Financial Disclosures within 60 days of filing the Petition" },
    "PDD2": { "type": "process", "text": "To move your case forward, you must fill out: \n        - FL-140 (Declaration of Disclosure)\n        - FL-150 (Income & Expense + paystubs)\n        - FL-142 or FL-160 (Property Declaration) — If using FL-160, complete TWO: one for community property and one for separate property\n        - Last 2 years of tax returns" },
    "PDDReview": { "type": "process", "text": "Recommended: Check in with Self-Help Center to verify PDDs were done correctly " },
    "PDD3": { "type": "process", "text": "Make a copy of your forms and attachments" },
    "PDD4": { "type": "process", "text": "Choose a server: an adult 18+ (not you)" },
    "PDD5": { "type": "process", "text": "Serve your financial disclosures (FL-140, FL-150, FL-142 or FL-160, tax returns) on your spouse by MAIL or PERSONAL SERVICE (server must be 18+, not you)" },
    "PDD6": { "type": "process", "text": "Fill out FL-141 (Declaration re: Service of Declaration of Disclosure) — check mail or personal service as used" },
    "PDD7": { "type": "process", "text": "File the original FL-141 with the court. Keep a copy for your records (FL-141 is filed with the court, but not served)" },

    "C1": { "type": "decision", "text": "Were you served/given divorce papers (Petition + Summons)?" },
    "C2N": { "type": "process", "text": "You can file a Response even if you haven't been formally served, to avoid default. You can also raise improper service in your Response or by motion." },
    "R1": { "type": "decision", "text": "Do you believe the service was improper?" },
    "R1a": { "type": "process", "text": "You can challenge service while still responding to avoid default. Talk to the Self-Help Center/FLF for options." },
    "EXT0": { "type": "decision", "text": "Do you need more than 30 days to file your Response (FL-120)?" },
    "EXT1": { "type": "process", "text": "Ask Petitioner to sign a written stipulation extending your Response deadline to a specific date. File the stipulation (and any required Stipulation & Proposed Order) before Day 30." },
    "EXT2": { "type": "process", "text": "File a Request for Order (FL-300) asking to extend the Response deadline. If the deadline is imminent, request ex parte and attach a declaration showing good cause and efforts to stipulate." },
    "R2": { "type": "decision", "text": "Do you want to change the case type?" },
    "R2a": { "type": "process", "text": "In your Response, you can request to change from Legal Separation to Divorce or to Nullity. Talk to Self-Help/FLF about amending case type." },
    "C2": { "type": "decision", "text": "Do you agree with what is being requested by your spouse?" },
    "C2a": { "type": "decision", "text": "Has it been more than 30 days since you received the petition?" },
    "C3": { "type": "process", "text": "Fill out a Response (FL-120)" },
    "C3Y": { "type": "process", "text": "If your spouse hasn't filed for a default, you can still file a Response. If it's been more than 30 days AND your spouse has asked the court for a default, you may no longer be able to file a Response." },
    "C4": { "type": "decision", "text": "Do you and your spouse have children?" },
    "C5": { "type": "process", "text": "Also complete FL-105 (UCCJEA) and attach it to your Response (FL-120)" },
    "C6": { "type": "process", "text": "Consider filing a Fee Waiver Request (FW-001) and Order (FW-003) if needed" },
    "CFL2": { "type": "process", "text": "Fill out Alternative Dispute Resolution (ADR) Options (FL-2)" },
    "CRev": { "type": "process", "text": "Recommended: Have Self-Help Center/FLF review your Response packet (FL-120, FL-105 if any, FW-001/FW-003 if used) before filing" },
    "C6a": { "type": "process", "text": "Make 2 copies AND file with the court:\n        - Your Response (FL-120)\n        - ADR Options (FL-2)\n        - If you have children, FL-105\n        - Fee Waiver forms FW-001 and FW-003" },
    "C7": { "type": "decision", "text": "How will you serve your filed Response on your spouse?" },
    "C7M": { "type": "process", "text": "Have someone 18+ (not you) mail a copy of your filed Response (and FL-105 if used)" },
    "C7M1": { "type": "process", "text": "Server completes FL-335 (Proof of Service by Mail): fills in when/where mailed, signs and dates" },
    "C8": { "type": "process", "text": "Make a copy of FL-335. File the original FL-335 with the court. Keep a copy" },
    "C7P": { "type": "process", "text": "Have someone 18+ (not you) hand-deliver a copy of your filed Response (and FL-105 if used)" },
    "C7P1": { "type": "process", "text": "Server completes FL-330 (Proof of Personal Service): fills in how/when/where delivered; signs and dates" },
    "C3a": { "type": "decision", "text": "Would you like a full written agreement with your spouse on everything (property, custody, etc.)?" },
    "DWOA": { "type": "process", "text": "To continue with your Response, you must share Preliminary Financial Disclosures within 60 days of filing your Response" },
    "C10PDD": { "type": "process", "text": "Before signing any Marital Settlement Agreement (MSA), BOTH sides must complete and serve Preliminary Financial Disclosures (PDDs). This is required even if you agree on everything." },
    "C11": { "type": "process", "text": "Work with your spouse to write a marriage settlement agreement so you can move forward with agreement-based judgment (Default with Agreement OR Uncontested)" },
    "C12": { "type": "process", "text": "You must sign the agreement and have your signature notarized" },
    "C13": { "type": "process", "text": "To complete a Default with Agreement, you still need to share financial information with your spouse " },
    "C2b": { "type": "process", "text": "This is a 'true default.' You do not need to file a Response, nor do you need to share financial information. Note: only suitable if you agree with everything filed in the Petition" },
    "C2d": { "type": "process", "text": "The Petitioner is responsible for moving the case forward, and you give up your right to participate." },

    "Pet_PDDCheck": { "type": "process", "text": "You must complete Preliminary Financial Disclosures BEFORE you can finalize your case." },
    "FC_Resp": { "type": "decision", "text": "Has a Response (FL-120) been filed?" },
    "FC_Agree_Y": { "type": "decision", "text": "Do you and your spouse agree on all major issues (custody, support, property, debts)?" },
    "Pet_PathC": { "type": "process", "text": "You can file for an Uncontested Case" },
    "Pet_PathD1": { "type": "process", "text": "As of now, you may have a Contested Case, but there are ways to resolve disagreements" },
    "FC_30": { "type": "decision", "text": "Has it been 30 days or more since the Petition was served?" },
    "FC_Alt": { "type": "decision", "text": "Will BOTH of you sign FL-130 (Appearance, Stipulation & Waivers)?" },
    "FC_WaitNote": { "type": "process", "text": "Wait 30 days after service. If no Response is filed after 30 days, continue below." },
    "FC_Agree_N": { "type": "decision", "text": "Do you and your spouse agree on all major issues?" },
    "Pet_PathB": { "type": "process", "text": "You can file for Default with Agreement (both sides must complete PDDs and sign a notarized agreement)" },
    "Pet_PathA": { "type": "process", "text": "You can file for a True Default" },

    "F2": { "type": "process", "text": "Default Without Agreement" },
    "DefaultCheck": { "type": "process", "text": "Check you're ready to request a true default judgment: \n        - It's been more than 30 days since you served the Petition AND your spouse has not filed a Response (FL-120)" },
    "DCheck2": { "type": "process", "text": "You've filed:\n        - FL-115 (Proof of Service of Summons)\n        - FL-141 (Service of Declaration of Disclosure)" },
    "DCheck4": { "type": "process", "text": "If you haven't filed FL-115 or FL-141, you can still file them with your default judgment packet" },
    "F2N": { "type": "decision", "text": "Does your Petition ask for exactly what you want the court to order?" },
    "F2N1": { "type": "process", "text": "You need to amend your Petition (FL-100), serve again, and wait 30 days before requesting default" },
    "DKids": { "type": "decision", "text": "Do you and your spouse have minor children together?" },
    "DKidsForms": { "type": "process", "text": "Attach these forms to your FL-180 (Judgment) so the court can make custody and support orders. If you have existing court orders, attach those instead:\n        - FL-341 (Custody & Visitation Attachment): Required if there is no existing order. Explains how you want custody and visitation arranged.\n        - FL-342 (Child Support Attachment): Required if there is no support order. Tells the court what child support you're asking for.\n        - FL-192 (Notice of Rights and Responsibilities): Required. Explains child support duties and how to request cost sharing or changes.\n        - FL-195 (Income Withholding Order): Optional. Use this if you want child support paid directly from your spouse’s paycheck.\n        Also file: FL-191 (Child Support Case Registry): Required if not already submitted. File this with your judgment packet, but do *not* attach it to your Judgment.\n    " },
    "DNeedForms": { "type": "decision", "text": "Do you need the court to make orders about property, support, or attorney’s fees?" },
    "DProp1": { "type": "process", "text": "Need property orders?\n        - If you haven’t filed FL-160 or have changes, fill and file a new FL-160 (Property Declaration)\n        - If no changes, check the box on FL-165 that says so\n        - Attach FL-345 (Property Order Attachment) to your Judgment (FL-180) to show how you want property divided" },
    "DSupp1": { "type": "process", "text": "Need spousal support or attorney’s fees?\n        - If you haven’t filed FL-150 (Income & Expense Declaration) in the last 90 days or have updates, fill one out and attach it to FL-165\n        - If no changes, check the box on FL-165 that says so" },
    "DSupp2": { "type": "process", "text": "Also attach to your Judgment:\n        - FL-343 (Spousal Support Order Attachment): Tells the court what support you want them to order\n        - FL-157 (Spousal Support Declaration Attachment): Optional, but helps the court decide long-term support — without it, the judge may not have enough information\n        - FL-435 (Earnings Assignment Order): Optional — use this if you want support sent directly from your spouse’s paycheck" },
    "DMil": { "type": "decision", "text": "Is the Respondent currently on active duty in the U.S. military?" },
    "DMilNote": { "type": "process", "text": "Default is restricted by the Servicemembers Civil Relief Act (SCRA). You may need a waiver/appearance or court findings. Talk to Self-Help/FLF before submitting your default packet." },
    "DCP": { "type": "decision", "text": "Does your proposed Judgment divide ALL community property & debts, including retirement accounts, or clearly reserve those issues?" },
    "DCPfix": { "type": "process", "text": "Fix before filing: complete/attach FL-160 (Property Declaration) as needed and use FL-345 (Property Order Attachment), or clearly RESERVE property issues in the Judgment." },
    "DSS": { "type": "decision", "text": "Are you asking to terminate or waive spousal support?" },
    "DSScheck": { "type": "process", "text": "Make sure your Petition asked for termination/waiver and explain the basis. In long-term marriages (~10+ years), outright termination is uncommon — consider reserving jurisdiction." },
    "DCoreForms": { "type": "process", "text": "Complete your mandatory forms:\n        - FL-165 (Request to Enter Default)\n        - FL-170 (Declaration for Default/Uncontested)\n        - FL-180 (Judgment)\n        - FL-190 (Notice of Entry of Judgment)" },

    "RespPDD_B": { "type": "decision", "text": "Has the Respondent completed & served Preliminary Disclosures (FL-140, FL-150, FL-142 or two FL-160s) and filed FL-141?" },
    "RPDD": { "type": "process", "text": "Step 3: Completing Preliminary Financial Disclosures" },
    "F8": { "type": "process", "text": "Default with Agreement: Spouse didn’t respond, but you have a written and notarized agreement" },
    "F8kids": { "type": "decision", "text": "Do you and your spouse have minor children?" },
    "F9kids": { "type": "process", "text": "Fill out:\n        - FL-165 (Request to Enter Default)\n        - FL-180 (Judgment) + with your attached agreement signed + notarized\n        - FL-170 (Declaration)\n        - FL-190 (Notice of Entry)\n        - Fl-192 (Notice of Rights and Responsibilities) + ATTACH to your Judgment (FL-180)\n        - FL-191 (Child Support Case Registry Form)\n        - If child support will be taken directly from other parent's paycheck: (FL-195)" },
    "F10kids": { "type": "process", "text": "Attach to your Judgment (FL-180) if needed: Any Custody Orders (FL-341), Child Support Orders (FL-342), Spousal Support Orders (FL-343), Property Orders (FL-345), Income Withholding Orders (FL-435), Support Factors (FL-157)" },
    "F9": { "type": "process", "text": "Fill out:\n        - FL-165 (Request to Enter Default)\n        - FL-180 (Judgment) + with your attached agreement signed + notarized\n        - FL-170 (Declaration)\n        - FL-190 (Notice of Entry) " },
    "F10": { "type": "process", "text": "Attach to your Judgment (FL-180) if needed: Spousal Support Orders (FL-343), Property Orders (FL-345), Income Withholding Orders (FL-435), Support Factors (FL-157)" },

    "RespPDD_C": { "type": "decision", "text": "Has the Respondent completed & served Preliminary Disclosures and filed FL-141? (Required before signing an MSA)" },
    "E3": { "type": "process", "text": "Uncontested Case - your spouse filed a Response, but you have a written agreement" },
    "E3b": { "type": "decision", "text": "Do you and your spouse have minor children?" },
    "E4k": { "type": "process", "text": "Fill out:\n        - FL-180 (Judgment) + ATTACH your signed agreement to this form\n        - FL-170 (Declaration for Uncontested Dissolution)\n        - FL-190 (Notice of Entry of Judgment)\n        - FL-130 (Appearance & Waivers)\n        - FL-192 (Notice of Rights) + ATTACH to your Judgment (FL-180)\n        - Fl-191 (Child Support Case Registry Form)\n        - If child support will be taken directly from other parent's paycheck: (FL-195)" },
    "E5k": { "type": "process", "text": "Attach to your Judgment (FL-180) if needed: Any Custody Orders (FL-341), Child Support Orders (FL-342), Spousal Support Orders (FL-343), Property Orders (FL-345), Income Withholding Orders (FL-435), Support Factors (FL-157)" },
    "E4": { "type": "process", "text": "Fill out:\n        - FL-180 (Judgment) + ATTACH your signed agreement to this form\n        - FL-170 (Declaration for Uncontested Dissolution)\n        - FL-190 (Notice of Entry Judgment)\n        - FL-130 (Appearance & Waivers)" },
    "E5": { "type": "process", "text": "Attach to your Judgment (FL-180) if needed: Spousal Support Orders (FL-343), Property Orders (FL-345), Income Withholding Orders (FL-435), Support Factors (FL-157)" },
    "E6": { "type": "decision", "text": "Decide if you will waive final financial disclosures" },
    "E7": { "type": "process", "text": "You and your spouse must fill out and sign FL-144 (Waiver of Final Declarations of Disclosures)" },
    "E7a": { "type": "process", "text": "Follow the steps you did for preliminary financial declarations. But, on the Declaration of Disclosure (form FL-140) and Declaration Regarding Service of Declaration of Disclosure (form FL-141) check the boxes that say final and not preliminary." },
    "ReviewJudgment": { "type": "process", "text": "Before filing your final divorce packet, it is critical that you now review this packet with the Self-Help Center staff via an online Zoom appointment before filing to confirm your Judgment packet is correct. If you do not, your Judgment packet may be rejected, or your divorce may be incorrect." },
    "Submit": { "type": "process", "text": "Submit the original Judgment packet + 2 copies to the clerk with 2 envelopes and enough postage. If everything required is there, a judge will sign the judgment and the clerk will stamp the Judgment and Notice of Entry of Judgment as 'filed'" },

    "E10": { "type": "decision", "text": "Is this an emergency (you, your child or your property is at risk of irreparable harm)?" },

    "PDD_ASW_Both": { "type": "decision", "text": "Have BOTH parties completed & served Preliminary Disclosures and filed FL-141s?" },
    "PDD_ASW_Check": { "type": "process", "text": "Both parties must complete Preliminary Financial Disclosures before continuing." },
    "E3_ASW": { "type": "process", "text": "Continue to file your case as uncontested via ASW — attach FL-130 (Appearance, Stipulation & Waivers) with your signed agreement" },

    "RFOIntro": { "type": "process", "text": "A Request for Order (RFO) is how you ask the court to make orders before the case is finalized — e.g., for custody, visitation, temporary support, or exclusive use of property." },
    "RFOAll": { "type": "process", "text": "Note: You can request more than one type of order (resolve multiple issues) with the same RFO form (FL-300)" },
    "RF1": { "type": "decision", "text": "What issue is contested?" },
    "R3": { "type": "process", "text": "Child custody or support" },
    "R4": { "type": "process", "text": "Spousal support" },
    "R5": { "type": "process", "text": "Property or debt division" },
    "R6": { "type": "process", "text": "Attorney’s fees" },
    "R7": { "type": "process", "text": "Other issues (property control, financial disclosures, etc.)" },

    "RE3": { "type": "process", "text": "Attend your court hearing. The judge will review both parties’ forms and make a decision." },
    "RFO_After": { "type": "decision", "text": "Was your RFO only to extend your Response deadline?" },
    "RF2": { "type": "decision", "text": "Are all issues now resolved?" },
    "RF3": { "type": "process", "text": "At the Status Conference, the judge may set your case for trial if an agreement can't be reached with RFOs." },
    "TrialPrep": { "type": "process", "text": "If set for trial: follow the court’s trial-prep orders (exchange disclosures per local rules, witness/exhibit lists, briefs). Consider getting legal help." },
    "RF4": { "type": "process", "text": "You may now be able to finalize your divorce. Attach any RFO orders to your final Judgment packet." },

    "EXT2a": { "type": "process", "text": "If Day 30 already passed, check the docket: if no default (FL-165) is on file, you can still file your Response right away." },
    "EXT2b": { "type": "decision", "text": "Do you still need the court to extend your Response deadline?" },

    "FLFFCS": { "type": "process", "text": "It is strongly recommended that you review any Request for Orders regarding child custody with Self Help Center staff prior to filing" },
    "RB1": { "type": "process", "text": "Fill out + File: \n    -  Request for Order (FL-300) for child custody and/or support\n    - If asking for financial support, also file a FL-150 (Income & Expense) if not previously filed in last 90 days, AND FL-342 (Child Support)" },
    "RA2": { "type": "process", "text": "If you have a custody dispute, the court can refer you and your spouse to Family Court Services (FCS) for child custody recommending counseling before hearing an RFO" },

    "RB2": { "type": "process", "text": "Fill out: \n    - Request for Order (FL-300) for spousal support\n    -  FL-150 (Income & Expense) if not previously filed in the last 90 days\n    - FL-157 (Spousal Support Declaration) if looking for long-term support" },

    "RC1": { "type": "process", "text": "Disagreements on property division can be very complex. If you and your spouse have significant conflict around property or debt division and need help, visit Family Law ADR Program which provides, at a low cost, mediators and arbitrators that can resolve conflict to prevent the case from advancing to trial. It is also recommended that you speak to the Self-Help Center staff either in person or via LiveChat." },

    "RC2": { "type": "process", "text": "Fill out:\n    - Request for Order (FL-300)\n    - FL-150 (Income & Expense Declaration) explaining financial need, if not already filed in the last 90 days" },

    "RD1": { "type": "process", "text": "Fill out: \n    -  Request for Order (FL-300) for issue\n    - You can explain the situation in MC-025 or an attached declaration" },

    "RFOrv": { "type": "process", "text": "Recommended: Have the Self-Help Center/FLF review your FL-300 packet (attachments, FL-150 if required, timelines) before filing" },
    "RE1": { "type": "process", "text": "File FL-300 packet with the Clerk" },
    "SR1": { "type": "decision", "text": "The next step is to serve your spouse with your Request For Order. How will you serve your Request for Order (FL-300)?" },

    "SMail1": { "type": "process", "text": "You can serve by mail if:\n    - You are the Petitioner AND the Respondent has already filed a Response\n    - You are the Respondent\n    - The court did not order personal service (check boxes 7 or 8 on FL-300)" },
    "SMail2": { "type": "process", "text": "Your server must:\n- Be 18+ and not part of the case\n- Mail:\n    • A copy of FL-300 + all attachments\n    • Blank FL-320 (Response)\n    • Any FL-150 (Income & Expense) filed + blank copy\n    • All other filed forms (except fee waivers)" },
    "SMail3": { "type": "process", "text": "Mail at least 16 court days + 5 calendar days before the hearing" },
    "SMail4": { "type": "process", "text": "Have your server complete FL-335 (Proof of Service by Mail), sign it, and you file it at least 5 court days before the hearing" },

    "SPerson1": { "type": "process", "text": "You must use personal service if:\n    - You are the Petitioner and your spouse hasn't filed a Response\n    - The court ordered personal service (see box 7 or 8 on FL-300)" },
    "SPerson2": { "type": "process", "text": "Your server must:\n    - Be 18+ and not part of your case\n    - Deliver:\n        • A copy of FL-300 + attachments\n        • Blank FL-320 (Response)\n        • Any FL-150 filed + blank copy\n        • All other filed forms (except fee waivers)" },
    "SPerson3": { "type": "process", "text": "Service must be done at least 16 court days before the hearing" },
    "SPerson4": { "type": "process", "text": "Server fills out FL-330 (Proof of Personal Service), signs it, and you file it at least 5 court days before the hearing" },

    "RA1": { "type": "process", "text": "Start: Ex Parte Emergency Request" },
    "EXQ": { "type": "decision", "text": "Do you already have a case number?" },
    "Step1": { "type": "process", "text": "Use existing case number" },
    "Step1B": { "type": "process", "text": "You must start a family law case first (e.g., custody case, divorce, or restraining order)" },
    "EMReq": { "type": "decision", "text": "Is there immediate danger or irreparable harm?" },
    "EMQual": { "type": "process", "text": "You may qualify for a temporary emergency order" },
    "EMStop": { "type": "process", "text": "This may not be an emergency. File a Request for Order instead" },
    "ContactCourt": { "type": "process", "text": "It is highly recommended that you review any emergency orders with the self-help clinic in-person, or online through LiveChat" },
    "FillForms": { "type": "process", "text": "Fill out your forms:" },
    "FL300": { "type": "process", "text": "FL-300: Request for Order — Check 'Temporary Emergency Orders' on Page 1:\n    - If about custody, check the 'I request emergency orders' box in item 2 on Page 2\n    - If the order is about property, check the 'I request emergency orders' box in item 5 on Page 3" },
    "Facts10": { "type": "process", "text": "Use Item 10 on Page 4 to explain the urgency of the matter and why immediate danger or irreparable harm exists using facts" },
    "UseMC025": { "type": "process", "text": "Need more space? Check box and attach MC-025" },
    "CustodyCheck": { "type": "decision", "text": "Is this order about custody or visitation?" },
    "DetailCustody": { "type": "process", "text": "In your FL-300 include: dates of harm, current parenting, how this changes it" },
    "AttachOrder": { "type": "process", "text": "Attach to your FL-300 any existing custody/visitation orders if you have one, and explain how this would change that order. If you don't have an order, explain how this emergency order would change things" },
    "FL105Check": { "type": "decision", "text": "Do you already have a UCCJEA (form FL-105) filed in this case?" },
    "FL105Explain": { "type": "process", "text": "You must fill out and file FL-105 (Declaration Under Uniform Child Custody Jurisdiction and Enforcement Act)" },
    "FL105Changed": { "type": "decision", "text": "Has any info on the FL-105 changed since it was filed?" },
    "FL105Update": { "type": "process", "text": "You must file an updated FL-105 with the new information" },
    "FL105NoChange": { "type": "process", "text": "No update needed. Continue with the emergency request" },
    "FinancesCheck": { "type": "decision", "text": "Are you also asking for financial orders (support)?" },
    "FL150": { "type": "process", "text": "Fill out and attach to FL-300 your FL-150 (Income & Expense Declaration)" },
    "Skip150": { "type": "process", "text": "FL-150 not needed" },
    "FL305": { "type": "process", "text": "Fill out and attach to FL-300 your FL-305: Temporary Emergency Orders — list what you're requesting" },
    "DocsAttach": { "type": "process", "text": "Attach your FL-300 packet supporting documents (letters from witnesses (signed), police reports, etc.)" },
    "ServeEx": { "type": "process", "text": "Make 4 copies of everything, including attachments. You then must have a copy personally delivered by you or another adult to the other party/or their attorney, along with a cover letter explaining that it is an emergency ex parte request. The notice/delivery of your unfiled document must occur by 10:00 AM on a court day in order to file the documents the next court day. Holidays and weekends will extend the 24 hour waiting period." },
    "FileEx": { "type": "process", "text": "Once this delivery has been done, complete local form FL-8 saying when and how the papers were given to the other party. Then file 2 copies + the original of the FL-300 packet with attached forms along with the FL-8 at the courthouse" },
    "JudgeEx": { "type": "process", "text": "The judge will then consider the request after the other party has had 24 hours to file a response.  The 24 hour time starts at 10:00 AM of the court day after the delivery of the documents." },
    "JudgeDe": { "type": "process", "text": "Ask the clerk when you can come back to get the judge's decision. It may be that day or the next day the court is open." },

    "Move_ExCTA": { "type": "decision", "text": "Do you need to file an Emergency Request (Ex Parte)?" },
    "Move_RFOCTA": { "type": "decision", "text": "Do you need a temporary order about a specifc issue in your case (RFO)?" },
    "Unsure": { "type": "process", "text": "Unsure where you are in the case?" },
    "Role": { "type": "decision", "text": "Did you start the divorce case?" },
    "MFP1": { "type": "decision", "text": "Have you filed your Petition (FL-100) and Summons (FL-110)?" },
    "MFP2": { "type": "decision", "text": "Have you properly served your Petition/Summons and filed FL-115 (Proof of Service of Summons)?" },
    "MFP3": { "type": "decision", "text": "Have you completed & served your Preliminary Financial Disclosures and filed FL-141?" },
    "MFP4": { "type": "process", "text": "Great — you're ready to move the case toward judgment." },
    "MFR1": { "type": "decision", "text": "Were you served with Petition/Summons?" },
    "MFR2": { "type": "decision", "text": "Which applies to you?" },
    "MFR3": { "type": "decision", "text": "Have you properly served it and filed Proof of Service (FL-335/FL-330)?" },
    "MFR4": { "type": "decision", "text": "Have you completed Preliminary Financial Disclosures + filed FL-141?" },

    "MF": { "type": "process", "text": "What happens if the Respondent (other party) isn't participating or has stopped participating?" },
    "MFa": { "type": "decision", "text": "Has your spouse filed a Response (FL-120)?" },
    "MFb": { "type": "process", "text": "If your spouse filed a Response but won't serve Preliminary Disclosures, the court can compel them. Talk to the Self-Help Center for how to request orders compelling disclosure." },
    "MFc": { "type": "process", "text": "If it's been more than 30 days since service of the Petition/Summons and no Response was filed, you can request a True Default and move forward without their input." },

    "MFr0": { "type": "decision", "text": "Is the Petitioner not moving the case forward?" },
    "MFr1": { "type": "process", "text": "You can ask the court to set deadlines, set a status conference, or set the case for trial. Talk to Self-Help/FLF about the right motion or request for your court." },
    "MFr2": { "type": "process", "text": "Keep working the case (disclosures, agreements, or RFOs) or request a status conference if progress stalls." },

    "MF2": { "type": "process", "text": "What is a status conference?" },
    "MF2a": { "type": "process", "text": "A status conference is a hearing where a judge checks on case progress, sets deadlines, and helps keep the case on track. Either party can request one." },

    "MF3": { "type": "process", "text": "When is my divorce 'final'?" },
    "MF3a": { "type": "process", "text": "There are  two separate ideas:\n        - 'Terminate marital status': The EARLIEST date a judge can legally end your marriage is 6 months + 1 day after key service/appearance (see below).\n        - 'Final judgment': When your case is fully finished only when the court enters a Judgment that resolves or reserves ALL issues (property, custody, support, fees)." },
    "MF3b": { "type": "process", "text": "6-month timer for terminating marital status starts from the earliest of:\n        - The date your spouse was served with Petition/Summons\n        - The date they filed a Response (FL-120)\n        - The date FL-130 (Appearance, Stipulations, and Waivers) was filed" },
    "MF3c": { "type": "process", "text": "When is my legal separation final?" },
    "LS": { "type": "process", "text": "It's final when the Judgment is entered." },

    "RPDD2": { "type": "process", "text": "To move your case forward, you must fill out: \n        - FL-140 (Declaration of Disclosure)\n        - FL-150 (Income & Expense + paystubs)\n        - FL-142 or FL-160 (Property Declaration) — If using FL-160, complete TWO: one for community property and one for separate property\n        - Last 2 years of tax returns" },
    "RPDDRv": { "type": "process", "text": "Recommended: Have the Self-Help Center/FLF verify PDDs were done correctly" },
    "RPDD3": { "type": "process", "text": "Make a copy of your forms and attachments" },
    "RPDD4": { "type": "process", "text": "Choose a server: an adult 18+ (not you)" },
    "RPDD5": { "type": "process", "text": "Serve your financial disclosures on your spouse by MAIL or PERSONAL SERVICE (server must be 18+, not you)" },
    "RPDD6": { "type": "process", "text": "Fill out FL-141 (Declaration re: Service of Declaration of Disclosure) — check mail or personal service as used" },
    "RPDD7": { "type": "process", "text": "File the original FL-141 with the court. Keep a copy for your records (FL-141 is filed, not served)" }
  },
  "edges": [
    { "from": "A", "to": "A1" },
    { "from": "A", "to": "A1a" },
    { "from": "A", "to": "A2" },
    { "from": "A", "to": "Pet_Start" },
    { "from": "A", "to": "A3" },
    { "from": "A", "to": "A5" },
    { "from": "A", "to": "A6" },

    { "from": "A1", "to": "A0b" },
    { "from": "A0b", "to": "A0", "when": "Yes - I may qualify for annulment" },
    { "from": "A0b", "to": "ANN_DEF", "when": "Unsure? See what may qualify you for an annulment." },
    { "from": "A0b", "to": "ANN_DEF", "when": "No" },
    { "from": "ANN_DEF", "to": "ANN_NOTE" },
    { "from": "ANN_NOTE", "to": "A0" },

    { "from": "A0", "to": "A0_YES_DIV", "when": "Yes, and I also want a divorce or legal separation" },
    { "from": "A0", "to": "CUST_ONLY", "when": "Yes, but I do NOT want a divorce or legal separation" },
    { "from": "A0", "to": "AR", "when": "No" },
    { "from": "A0_YES_DIV", "to": "AR" },

    { "from": "A1", "to": "AR" },
    { "from": "AR", "to": "SD0", "when": "Yes" },

    { "from": "AR", "to": "VEN0", "when": "No" },
    { "from": "VEN0", "to": "VEN1", "when": "Yes" },
    { "from": "VEN1", "to": "VEN2", "when": "Yes" },
    { "from": "VEN2", "to": "B1" },
    { "from": "VEN1", "to": "VEN3", "when": "No" },
    { "from": "VEN3", "to": "LS_EXPL" },
    { "from": "LS_EXPL", "to": "LS_STEPS" },
    { "from": "LS_STEPS", "to": "B1" },
    { "from": "VEN0", "to": "LSC2", "when": "No" },
    { "from": "LSC2", "to": "LSEP", "when": "Yes" },
    { "from": "LSEP", "to": "LS_EXPL" },
    { "from": "LSC2", "to": "NoLS", "when": "No" },

    { "from": "SD0", "to": "SD2", "when": "Yes" },
    { "from": "SD0", "to": "B1", "when": "No" },
    { "from": "SD2", "to": "SD3", "when": "No" },
    { "from": "SD2", "to": "SDfail", "when": "Yes" },
    { "from": "SD3", "to": "SD4", "when": "No" },
    { "from": "SD3", "to": "SD3a", "when": "Yes" },
    { "from": "SD3a", "to": "SD4", "when": "Yes" },
    { "from": "SD3a", "to": "SDfail", "when": "No" },
    { "from": "SD4", "to": "SD5", "when": "Yes" },
    { "from": "SD4", "to": "SDfail", "when": "No" },
    { "from": "SD5", "to": "SD6", "when": "Yes" },
    { "from": "SD5", "to": "SDfail", "when": "No" },
    { "from": "SD6", "to": "SD7", "when": "Yes" },
    { "from": "SD6", "to": "SDfail", "when": "No" },
    { "from": "SD7", "to": "SD8", "when": "Yes" },
    { "from": "SD7", "to": "SDfail", "when": "No" },
    { "from": "SDfail", "to": "B1" },

    { "from": "B1", "to": "B2" },
    { "from": "B2", "to": "B3" },
    { "from": "B3", "to": "B4", "when": "Yes" },
    { "from": "B3", "to": "FL2", "when": "No" },
    { "from": "B4", "to": "FL2" },
    { "from": "FL2", "to": "B5a" },
    { "from": "B5a", "to": "BRV1" },
    { "from": "BRV1", "to": "B5" },
    { "from": "B5", "to": "A1a" },

    { "from": "SD8", "to": "SD10" },
    { "from": "SD10", "to": "SD11" },
    { "from": "SD11", "to": "S11a" },
    { "from": "S11a", "to": "SD12" },
    { "from": "SD12", "to": "SD13" },
    { "from": "SD13", "to": "SD14" },
    { "from": "SD14", "to": "SD15" },
    { "from": "SD15", "to": "SD15a", "when": "Option A" },
    { "from": "SD15", "to": "SD15b", "when": "Option B" },
    { "from": "SD15b", "to": "SD17" },
    { "from": "SD15a", "to": "SD17" },
    { "from": "SD17", "to": "SD18" },
    { "from": "SD18", "to": "SD19" },
    { "from": "SD19", "to": "SD20" },
    { "from": "SD20", "to": "SD21" },
    { "from": "SD21", "to": "SD22" },
    { "from": "SD22", "to": "SD23" },
    { "from": "SD23", "to": "SD24" },
    { "from": "SD24", "to": "SD25" },
    { "from": "SD25", "to": "SD26" },
    { "from": "SD26", "to": "SD27" },
    { "from": "SD27", "to": "SD28" },
    { "from": "SD28", "to": "SD29" },
    { "from": "SD29", "to": "SD30" },
    { "from": "SD30", "to": "SD31" },
    { "from": "SD31", "to": "SD32" },
    { "from": "SD32", "to": "SD33" },
    { "from": "SD33", "to": "SD34" },
    { "from": "SD34", "to": "SD35" },
    { "from": "SD35", "to": "SD36" },
    { "from": "SD36", "to": "SD37" },
    { "from": "SD37", "to": "SD38" },
    { "from": "SD38", "to": "SD39" },
    { "from": "SD39", "to": "SD40" },

    { "from": "A1a", "to": "S0" },
    { "from": "S0", "to": "S0a" },
    { "from": "S0a", "to": "S1" },
    { "from": "S1", "to": "S1a", "when": "Overseas / on a U.S. military base / in jail" },
    { "from": "S1", "to": "CA1", "when": "In California" },
    { "from": "S1", "to": "OOS1", "when": "Another State" },
    { "from": "S1", "to": "Service_Alternate", "when": "I don't know where my spouse lives" },

    { "from": "CA1", "to": "P1", "when": "Yes" },
    { "from": "CA1", "to": "S2a", "when": "No" },

    { "from": "OOS1", "to": "P1O", "when": "Yes" },
    { "from": "OOS1", "to": "MAIL", "when": "No" },

    { "from": "P1", "to": "P6" },
    { "from": "P6", "to": "P7" },
    { "from": "P7", "to": "P10" },
    { "from": "P10", "to": "P10a" },
    { "from": "P10a", "to": "PSRev" },
    { "from": "PSRev", "to": "P12" },

    { "from": "P1O", "to": "P1" },

    { "from": "S2a", "to": "MAIL_NAR", "when": "Yes" },
    { "from": "S2a", "to": "P1", "when": "No - You must use personal service" },

    { "from": "MAIL", "to": "MAIL_NAR", "when": "Spouse is Cooperative" },

    { "from": "MAIL_NAR", "to": "OOS_A1" },
    { "from": "OOS_A1", "to": "OOS_A2" },
    { "from": "OOS_A2", "to": "OOS_A3" },
    { "from": "OOS_A3", "to": "OOS_A4" },
    { "from": "OOS_A4", "to": "OOS_A5" },
    { "from": "OOS_A5", "to": "OOS_A6" },
    { "from": "OOS_A6", "to": "OOS_A7" },
    { "from": "OOS_A7", "to": "OOS_A8" },
    { "from": "OOS_A8", "to": "MSRev" },

    { "from": "MAIL", "to": "OOS_M2", "when": "Spouse is NOT Cooperative AND is out of state" },
    { "from": "OOS_M2", "to": "OOS_B1" },
    { "from": "OOS_B1", "to": "OOS_B2" },
    { "from": "OOS_B2", "to": "OOS_B3" },
    { "from": "OOS_B3", "to": "OOS_B4" },
    { "from": "OOS_B4", "to": "OOS_B5" },
    { "from": "OOS_B5", "to": "MSRev" },
    { "from": "MSRev", "to": "OOS_B6" },

    { "from": "P12", "to": "PDD" },
    { "from": "OOS_B6", "to": "PDD" },
    { "from": "PDD", "to": "PDD2" },
    { "from": "PDD2", "to": "PDDReview" },
    { "from": "PDDReview", "to": "PDD3" },
    { "from": "PDD3", "to": "PDD4" },
    { "from": "PDD4", "to": "PDD5" },
    { "from": "PDD5", "to": "PDD6" },
    { "from": "PDD6", "to": "PDD7" },

    { "from": "A2", "to": "C1" },
    { "from": "C1", "to": "C2N", "when": "No" },
    { "from": "C2N", "to": "R2" },
    { "from": "C1", "to": "R1", "when": "Yes" },
    { "from": "R1", "to": "R1a", "when": "Yes" },
    { "from": "R1a", "to": "EXT0" },
    { "from": "R1", "to": "EXT0", "when": "No" },
    { "from": "EXT0", "to": "R2", "when": "No — I can file in time" },
    { "from": "EXT0", "to": "EXT1", "when": "Yes, I need more time, AND my spouse will agree to that" },
    { "from": "EXT1", "to": "R2" },
    { "from": "EXT0", "to": "EXT2", "when": "Yes, I need more time, BUT my spouse will not agree to that" },
    { "from": "EXT2", "to": "EXT2a" },

    { "from": "R2", "to": "R2a", "when": "Yes" },
    { "from": "R2a", "to": "C2" },
    { "from": "R2", "to": "C2", "when": "No" },

    { "from": "C2", "to": "C2a", "when": "No, I'd like to file a Response" },
    { "from": "C2a", "to": "C3", "when": "No" },
    { "from": "C2a", "to": "C3Y", "when": "Yes" },
    { "from": "C3Y", "to": "C3" },
    { "from": "C3", "to": "C4" },
    { "from": "C4", "to": "C5", "when": "Yes" },
    { "from": "C4", "to": "C6", "when": "No" },
    { "from": "C5", "to": "C6" },
    { "from": "C6", "to": "CFL2" },
    { "from": "CFL2", "to": "CRev" },
    { "from": "CRev", "to": "C6a" },

    { "from": "C6a", "to": "C7" },
    { "from": "C7", "to": "C7M", "when": "By mail" },
    { "from": "C7M", "to": "C7M1" },
    { "from": "C7M1", "to": "C8" },
    { "from": "C7", "to": "C7P", "when": "By personal service" },
    { "from": "C7P", "to": "C7P1" },
    { "from": "C7P1", "to": "C8" },

    { "from": "C8", "to": "C3a" },
    { "from": "C3a", "to": "DWOA", "when": "No" },

    { "from": "C2", "to": "C3a", "when": "Yes, so I don't want to file a Response" },
    { "from": "C3a", "to": "C10PDD", "when": "Yes" },
    { "from": "C10PDD", "to": "C11" },
    { "from": "C11", "to": "C12" },
    { "from": "C12", "to": "C13" },

    { "from": "C3a", "to": "C2b", "when": "No, I agree with everything in the Petition and don't need to respond" },
    { "from": "C2b", "to": "C2d" },
    { "from": "C2", "to": "C2d", "when": "No, I don't wish to be a part of the divorce process" },

    { "from": "Pet_Start", "to": "Pet_PDDCheck" },
    { "from": "Pet_PDDCheck", "to": "FC_Resp" },
    { "from": "FC_Resp", "to": "FC_Agree_Y", "when": "Yes" },
    { "from": "FC_Agree_Y", "to": "Pet_PathC", "when": "Yes" },
    { "from": "FC_Agree_Y", "to": "Pet_PathD1", "when": "No" },

    { "from": "FC_Resp", "to": "FC_30", "when": "No" },
    { "from": "FC_30", "to": "FC_Alt", "when": "No" },
    { "from": "FC_Alt", "to": "FC_WaitNote", "when": "No" },
    { "from": "FC_WaitNote", "to": "FC_Agree_N" },
    { "from": "FC_30", "to": "FC_Agree_N", "when": "Yes" },
    { "from": "FC_Agree_N", "to": "Pet_PathB", "when": "Yes" },
    { "from": "FC_Agree_N", "to": "Pet_PathA", "when": "No" },

    { "from": "Pet_PathA", "to": "F2" },
    { "from": "F2", "to": "DefaultCheck" },
    { "from": "DefaultCheck", "to": "DCheck2" },
    { "from": "DCheck2", "to": "DCheck4" },
    { "from": "DCheck4", "to": "F2N" },
    { "from": "F2N", "to": "F2N1", "when": "No" },
    { "from": "F2N1", "to": "A1" },
    { "from": "F2N", "to": "DKids", "when": "Yes" },
    { "from": "DKids", "to": "DKidsForms", "when": "Yes" },
    { "from": "DKids", "to": "DNeedForms", "when": "No" },
    { "from": "DKidsForms", "to": "DNeedForms" },
    { "from": "DNeedForms", "to": "DProp1", "when": "Yes" },
    { "from": "DProp1", "to": "DSupp1" },
    { "from": "DSupp1", "to": "DSupp2" },
    { "from": "DSupp1", "to": "DMil", "when": "No" },
    { "from": "DSupp2", "to": "DMil" },
    { "from": "DNeedForms", "to": "DMil", "when": "No" },
    { "from": "DMil", "to": "DMilNote", "when": "Yes" },
    { "from": "DMil", "to": "DCP", "when": "No" },
    { "from": "DCP", "to": "DCPfix", "when": "No" },
    { "from": "DCPfix", "to": "DSS" },
    { "from": "DCP", "to": "DSS", "when": "Yes" },
    { "from": "DSS", "to": "DSScheck", "when": "Yes" },
    { "from": "DSScheck", "to": "DCoreForms" },
    { "from": "DSS", "to": "DCoreForms", "when": "No" },
    { "from": "DCoreForms", "to": "ReviewJudgment" },

    { "from": "Pet_PathB", "to": "RespPDD_B" },
    { "from": "RespPDD_B", "to": "RPDD", "when": "No — they must do this first" },
    { "from": "RespPDD_B", "to": "F8", "when": "Yes" },
    { "from": "F8", "to": "F8kids" },
    { "from": "F8kids", "to": "F9kids", "when": "Yes" },
    { "from": "F9kids", "to": "F10kids" },
    { "from": "F10kids", "to": "E6" },
    { "from": "F8kids", "to": "F9", "when": "No" },
    { "from": "F9", "to": "F10" },
    { "from": "F10", "to": "E6" },

    { "from": "Pet_PathC", "to": "RespPDD_C" },
    { "from": "RespPDD_C", "to": "RPDD", "when": "No — they must do this first" },
    { "from": "RespPDD_C", "to": "E3", "when": "Yes" },
    { "from": "E3", "to": "E3b" },
    { "from": "E3b", "to": "E4k", "when": "Yes" },
    { "from": "E4k", "to": "E5k" },
    { "from": "E5k", "to": "E6" },
    { "from": "E3b", "to": "E4", "when": "No" },
    { "from": "E4", "to": "E5" },
    { "from": "E5", "to": "E6" },
    { "from": "E6", "to": "E7", "when": "Yes, we waive final disclosures" },
    { "from": "E6", "to": "E7a", "when": "No, we would not like to waive final disclosures" },
    { "from": "E7", "to": "ReviewJudgment" },
    { "from": "E7a", "to": "ReviewJudgment" },
    { "from": "ReviewJudgment", "to": "Submit" },

    { "from": "Pet_PathD1", "to": "E10" },

    { "from": "FC_Alt", "to": "PDD_ASW_Both", "when": "Yes" },
    { "from": "PDD_ASW_Both", "to": "PDD_ASW_Check", "when": "No" },
    { "from": "PDD_ASW_Both", "to": "E3_ASW", "when": "Yes" },
    { "from": "E3_ASW", "to": "E3b" },

    { "from": "A6", "to": "RFOIntro" },
    { "from": "E10", "to": "RFOIntro", "when": "No" },
    { "from": "RFOIntro", "to": "RFOAll" },
    { "from": "RFOAll", "to": "RF1" },
    { "from": "RF1", "to": "R3" },
    { "from": "RF1", "to": "R4" },
    { "from": "RF1", "to": "R5" },
    { "from": "RF1", "to": "R6" },
    { "from": "RF1", "to": "R7" },

    { "from": "RE3", "to": "RFO_After" },
    { "from": "RFO_After", "to": "C3", "when": "Yes" },
    { "from": "RFO_After", "to": "RF2", "when": "No" },
    { "from": "RF2", "to": "RF1", "when": "No" },
    { "from": "RF2", "to": "RF3", "when": "No; And RFOs won't work" },
    { "from": "RF3", "to": "TrialPrep" },
    { "from": "RF2", "to": "RF4", "when": "Yes" },
    { "from": "RF4", "to": "Pet_Start" },

    { "from": "EXT2a", "to": "EXT2b" },
    { "from": "EXT2b", "to": "RFOIntro", "when": "Yes" },
    { "from": "EXT2b", "to": "C3", "when": "No — file your Response now" },

    { "from": "R3", "to": "FLFFCS" },
    { "from": "FLFFCS", "to": "RB1" },
    { "from": "RB1", "to": "RA2" },

    { "from": "R4", "to": "RB2" },

    { "from": "R5", "to": "RC1" },
    { "from": "RC1", "to": "RF2" },

    { "from": "R6", "to": "RC2" },

    { "from": "R7", "to": "RD1" },

    { "from": "RA2", "to": "RFOrv" },
    { "from": "RB2", "to": "RFOrv" },
    { "from": "RC2", "to": "RFOrv" },
    { "from": "RD1", "to": "RFOrv" },
    { "from": "RFOrv", "to": "RE1" },
    { "from": "RE1", "to": "SR1" },

    { "from": "SR1", "to": "SMail1", "when": "Mail" },
    { "from": "SMail1", "to": "SMail2" },
    { "from": "SMail2", "to": "SMail3" },
    { "from": "SMail3", "to": "SMail4" },
    { "from": "SMail4", "to": "RE3" },

    { "from": "SR1", "to": "SPerson1", "when": "In Person" },
    { "from": "SPerson1", "to": "SPerson2" },
    { "from": "SPerson2", "to": "SPerson3" },
    { "from": "SPerson3", "to": "SPerson4" },
    { "from": "SPerson4", "to": "RE3" },

    { "from": "A5", "to": "RA1" },
    { "from": "E10", "to": "RA1", "when": "Yes" },
    { "from": "RA1", "to": "EXQ" },
    { "from": "EXQ", "to": "Step1", "when": "Yes" },
    { "from": "EXQ", "to": "Step1B", "when": "No" },
    { "from": "Step1", "to": "EMReq" },
    { "from": "Step1B", "to": "EMReq" },
    { "from": "EMReq", "to": "EMQual", "when": "Yes" },
    { "from": "EMReq", "to": "EMStop", "when": "No" },
    { "from": "EMQual", "to": "ContactCourt" },
    { "from": "ContactCourt", "to": "FillForms" },
    { "from": "FillForms", "to": "FL300" },
    { "from": "FL300", "to": "Facts10" },
    { "from": "Facts10", "to": "UseMC025" },
    { "from": "UseMC025", "to": "CustodyCheck" },
    { "from": "CustodyCheck", "to": "FinancesCheck", "when": "No" },
    { "from": "CustodyCheck", "to": "DetailCustody", "when": "Yes" },
    { "from": "DetailCustody", "to": "AttachOrder" },
    { "from": "AttachOrder", "to": "FL105Check" },
    { "from": "FL105Check", "to": "FL105Explain", "when": "No" },
    { "from": "FL105Explain", "to": "FinancesCheck" },
    { "from": "FL105Check", "to": "FL105Changed", "when": "Yes" },
    { "from": "FL105Changed", "to": "FL105Update", "when": "Yes" },
    { "from": "FL105Update", "to": "FinancesCheck" },
    { "from": "FL105Changed", "to": "FL105NoChange", "when": "No" },
    { "from": "FL105NoChange", "to": "FinancesCheck" },
    { "from": "FinancesCheck", "to": "FL150", "when": "Yes" },
    { "from": "FinancesCheck", "to": "Skip150", "when": "No" },
    { "from": "FL150", "to": "FL305" },
    { "from": "Skip150", "to": "FL305" },
    { "from": "FL305", "to": "DocsAttach" },
    { "from": "DocsAttach", "to": "ServeEx" },
    { "from": "ServeEx", "to": "FileEx" },
    { "from": "FileEx", "to": "JudgeEx" },
    { "from": "JudgeEx", "to": "JudgeDe" },
    { "from": "JudgeDe", "to": "RF2" },

    { "from": "A3", "to": "Move_ExCTA" },
    { "from": "Move_ExCTA", "to": "RA1" },
    { "from": "A3", "to": "Move_RFOCTA" },
    { "from": "Move_RFOCTA", "to": "RFOIntro" },
    { "from": "A3", "to": "Unsure" },
    { "from": "Unsure", "to": "Role" },
    { "from": "Role", "to": "MFP1", "when": "Yes, I am the Petitioner" },
    { "from": "MFP1", "to": "B1", "when": "No" },
    { "from": "MFP1", "to": "MFP2", "when": "Yes" },
    { "from": "MFP2", "to": "A1a", "when": "No" },
    { "from": "MFP2", "to": "MFP3", "when": "Yes" },
    { "from": "MFP3", "to": "PDD", "when": "No" },
    { "from": "MFP3", "to": "MFP4", "when": "Yes" },
    { "from": "MFP4", "to": "Pet_Start" },
    { "from": "Role", "to": "MFR1", "when": "No, I am the Respondent" },
    { "from": "MFR1", "to": "A2", "when": "No" },
    { "from": "MFR1", "to": "MFR2", "when": "Yes" },
    { "from": "MFR2", "to": "A2", "when": "I will file a Response" },
    { "from": "MFR2", "to": "MFR3", "when": "I already filed a Response" },
    { "from": "MFR2", "to": "C2b", "when": "I agree with everything in the Petition/ I would not like to participate" },
    { "from": "MFR2", "to": "MFR4", "when": "We have a written agreement, but I didn't file a response" },
    { "from": "MFR3", "to": "C7", "when": "No" },
    { "from": "MFR3", "to": "MFR4", "when": "Yes" },
    { "from": "MFR4", "to": "RPDD", "when": "No" },
    { "from": "MFR4", "to": "Pet_Start", "when": "Yes" },

    { "from": "RPDD", "to": "Pet_PathB" },

    { "from": "A3", "to": "MF" },
    { "from": "MF", "to": "MFa" },
    { "from": "MFa", "to": "MFb", "when": "Yes" },
    { "from": "MFa", "to": "MFc", "when": "No" },

    { "from": "A3", "to": "MFr0" },
    { "from": "MFr0", "to": "MFr1", "when": "Yes" },
    { "from": "MFr0", "to": "MFr2", "when": "No" },

    { "from": "A3", "to": "MF2" },
    { "from": "MF2", "to": "MF2a" },

    { "from": "A3", "to": "MF3" },
    { "from": "MF3", "to": "MF3a" },
    { "from": "MF3a", "to": "MF3b" },
    { "from": "A3", "to": "MF3c" },
    { "from": "MF3c", "to": "LS" },

    { "from": "RPDD", "to": "RPDD2" },
    { "from": "DWOA", "to": "RPDD" },
    { "from": "C13", "to": "RPDD" },
    { "from": "RPDD2", "to": "RPDDRv" },
    { "from": "RPDDRv", "to": "RPDD3" },
    { "from": "RPDD3", "to": "RPDD4" },
    { "from": "RPDD4", "to": "RPDD5" },
    { "from": "RPDD5", "to": "RPDD6" },
    { "from": "RPDD6", "to": "RPDD7" }
  ]
}
